{
  "artist_name": "347AIDAN",
  "slug": "347aidan",
  "metadata": {
    "country": "CA",
    "genres": "[emo rap, indie, alternative, Social Media Pop, Contemporary Rap]",
    "active_years": "2003-06-08 - present",
    "band_type": "person",
    "lastfm_listeners": 438171,
    "lastfm_playcount": 6629910,
    "bio": "Aidan Fuller, professionally known as 347aidan, is a Canadian rapper originating from Cambridge, Ontario. Born on June 8, 2003, Fuller embarked on his musical journey in 2017, dedicating himself to crafting music as a central pursuit. His passion for music led him to release numerous singles and EPs on platforms such as SoundCloud and YouTube between 2017 and 2019, gradually establishing a modest fanbase from these early recordings. In June 2019, he transitioned his SoundCloud music to mainstream streaming services.\n\nIn 2020, Fuller's music achieved heightened visibility through a TikTok video he created for his track \"Demons and Monsters,\" which garnered millions of views on the platform. This viral exposure was a pivotal moment, leading to a surge in popularity for the song and prompting its official release in September 2020. The track garnered significant attention, achieving a million streams within its first week. Around this time, 347aidan's musical style evolved from rap into a dynamic blend of hip-hop, alternative, and grungy bedroom pop anthems. \n\nHis subsequent release, \"Dancing in My Room,\" gathered attention on TikTok before it was even released, due to a creator starting a dance trend to just the snippet of the song, resulting in countless dance videos. When the song was officially released on October 26, 2020, it amassed three million streams within its initial week. The track's rapid rise attracted the attention of Columbia Records, which signed Fuller to their roster shortly thereafter. \"Dancing in My Room\" received widespread recognition, earning a nomination for the 2021 SOCAN Songwriting Prize and achieving Platinum certification by Music Canada and the Recording Industry Association of America (RIAA).\n\nIn collaboration with prominent hip-hop producer Kenny Beats, known for his work with artists like Freddie Gibbs and Dominic Fike, Fuller released the hit single \"IDWK\" on January 25, 2021. The song was created during a creative session in Los Angeles, where the duo swiftly composed the track, showcasing Fuller's recording ability as he captured it in a single take. While in Los Angeles, Fuller also collaborated with Killstation, a notable figure in the indie music scene and a frequent collaborator with XXXtentacion.\n\nContinuing his trajectory, Fuller unveiled his first EP, \"Chasing Harmony,\" on October 22, 2021, further showcasing his creative range. He continued to expand his musical network, featuring on American rapper Sleepy Hallow's single \"Die Young,\" released on May 25, 2022.\n\nBeyond his musical accomplishments, 347aidan maintains an active presence on Instagram, frequently engaging with his fanbase through live sessions and other interactive content.",
    "allmusic_styles": [
      "Social Media Pop",
      "Contemporary Rap",
      "Pop-Rap",
      "Alternative/Indie Rock"
    ]
  },
  "tracks": [
    "Dancing in My Room"
  ],
  "albums": [],
  "similar_artists": [
    "Powfu",
    "Rxseboy",
    "MASN",
    "PAPITHBK",
    "Lund",
    "guccihighwaters"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/347aidan-1/800/600",
    "https://picsum.photos/seed/347aidan-2/800/600",
    "https://picsum.photos/seed/347aidan-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/347aidan"
}