{
  "artist_name": "Advantage Lucy",
  "slug": "advantage-lucy",
  "metadata": {
    "country": "JP",
    "genres": "[japanese, indie, female vocalists, Indie Pop, Alternative/Indie Rock]",
    "active_years": "1998 - 1998",
    "band_type": "group",
    "lastfm_listeners": 63613,
    "lastfm_playcount": 1910260,
    "bio": "advantage Lucy is a Japanese indie pop/neo-acoustic band. They play songs influenced by 60s janglepop, Swedish pop, and pretty much anything else that makes people feel good. Presently comprising vocalist Aiko and guitarist Yoshiharu Ishizaka, the group was formed in 1995 as a four piece, named Lucy Van Pelt after the Peanuts character of the same name. A fixture on the indies scene, Lucy Van Pelt released several records on the God's Pop Records imprint, growing their fan base countrywide through frequent club gigs, in-store appearances, and other special events. \n\nIn August 1998, the band changed its name to advantage Lucy per the request of the Peanuts trademark holders, signing several months later with Toshiba-EMI and releasing the EP Citrus e.p.. After several singles, the band made its full-length major label debut in May 1999 with  Fanfare, following up the next year with another full-length, Station. Both records featured Aiko's fresh, yearning vocals, backed up by Ishizaka's melodic, jangly guitar work and a stylish yet sincere image, making them an instant favorite with Tokyo's trendy kids. At the height of the band's popularity, guitarist and founding member Takayuki Fukumura left the group around this time to form the band Vasallo Crab 75 (he sadly passed away, not yet thirty, due to heart disease in 2003). The group, already operating with no full-time bassist, decided to press on as a trio. \n\nadvantage Lucy established their own label, Solaris Records, in January 2001 with the intention to start afresh, immediately releasing the mini albums Oolt Cloud and Anzu no kisetsu in March and April respectively. Additionally, in May of the same year Toshiba-EMI released a \"best of\" record containing selected tracks from 1996 to 2000 - an honor rarely bestowed on young \"indie\" bands. Shortly thereafter, tragedy struck again when drummer Kaname Banba developed a condition that rendered one of his legs unfit for drumming, and he too left the group. Reduced to its creative core of Aiko and Ishizaka, advantage Lucy continues to gig frequently with part-time members on drums and bass, and maintains an extremely loyal fan base.",
    "allmusic_styles": [
      "Indie Pop",
      "Alternative/Indie Rock",
      "Twee Pop"
    ]
  },
  "tracks": [
    "Katakuri No Hana"
  ],
  "albums": [],
  "similar_artists": [
    "Lucy van Pelt",
    "Cymbals",
    "Roly Poly Rag Bear",
    "Plus-Tech Squeeze Box",
    "risette",
    "jenny01"
  ],
  "youtube_videos": [
    {
      "title": "Katakuri No Hana",
      "video_id": "dgcpdju5cc0"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/dgcpdju5cc0/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/advantage%2blucy"
}