{
  "artist_name": "again&again",
  "slug": "againagain",
  "metadata": {
    "country": "XW",
    "genres": "[pop, rap, alternative pop, Alternative/Indie Rock, Post-Punk]",
    "active_years": "Unknown",
    "band_type": "group",
    "lastfm_listeners": 131891,
    "lastfm_playcount": 3490936,
    "bio": "again&again is a musical collective that transcends genres and borders. The group consists of seven artists from different parts of the world, who collaborate online to create songs that blend pop, rock, hip hop, and electronic elements. The members are Atwood, Garrett., RYCE, planet girl, juicebox caviar, bluknight, and Wet Day TImetable. They met through Soundcloud and Twitter, and decided to form a band in March 2020. Their debut single, “eighty-five”, was released on March 16, 2020, and received positive feedback from listeners and critics alike. Since then, they have released several more singles, such as “sunday morning”, “i don’t wanna know”, and “falling apart”. Their music is characterized by catchy melodies, honest lyrics, and diverse production. They have also collaborated with other artists, such as Colliding With Mars, Lani Rose, and Sad Puppy. again&again is a band that aims to connect with their fans and share their stories through music. They are currently working on their first album, which is expected to be released in 2023.",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Post-Punk"
    ]
  },
  "tracks": [
    "hours"
  ],
  "albums": [],
  "similar_artists": [
    "Andrew Garden",
    "Abhi The Nomad",
    "Sleepy Soul",
    "Weston Estate",
    "BabyJake",
    "Connor Price"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/75389e4210e43441e56ceefbba1c5255.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/19dc2bc63f8d655ccb23f4acd021c726.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/b00fd8fb708af9c498bf1740336dcac5.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/again%2526again"
}