{
  "artist_name": "Alexander Jean",
  "slug": "alexander-jean",
  "metadata": {
    "country": "FI",
    "genres": "[indie, rock, american, Alternative/Indie Rock, Contemporary Singer/Songwriter]",
    "active_years": "1865-12-08 - 1957-09-20",
    "band_type": "person",
    "lastfm_listeners": 34774,
    "lastfm_playcount": 232228,
    "bio": "Alexander Jean is an American husband-wife rock duo made up of Mark Ballas and BC Jean. The name for the duo is a combination of their two middle names. Ballas and Jean who first met in 2012. Mark Ballas was performing in a band while BC was singing her own material. They became an official music duo in 2015. The couple married in November 2016.[1][2]\n\nTheir debut single was \"Roses and Violets\". The single reached the Top 20 on Billboard's Hot 100 \"Bubbling Under\" chart. Alexander Jean was picked in November 2018 as Elvis Duran's Artist of the Month. The duo was featured on NBC's Today show hosted by Hoda Kotb and Kathie Lee Gifford, broadcast nationally in the United States where he performed a live version of their single \"Waiting for You\".\n\nMembers\nMark Ballas\nMark Alexander Ballas Jr. (born May 24, 1986) is an American dancer, choreographer, singer-songwriter, musician, and actor. He was in the 2012 Broadway musical Kinky Boots and the Off-Broadway musical Jersey Boys. Between 2005 and 2010, he was a member of The Ballas Hough Band, an American pop-rock band fronted by Ballas and Derek Hough. Ballas is a professional ballroom dancer on the ABC program Dancing with the Stars (DWTS). He began competing on the show in season five during the fall of 2007 and was nominated for an Emmy for Outstanding Choreography in 2011. Ballas released his first solo CD HurtLoveBox in March 2011.\n\nBC Jean\nBrittany Jean Carlson[3] (born April 22, 1987),[3] better known by her stage name BC Jean,[3][4] is an American singer-songwriter and actress, perhaps best known for writing the song \"If I Were a Boy\" which was later sung by Beyoncé and achieved worldwide commercial success.\n\nDiscography\nEPs\n2017: High Enough\nSingles\n2016: \"Roses and Violets\"\n2016: \"So Bad\"\n2017: \"Paper Planes\"\n2017: \"We Three Kings\" (feat. Casey Abrams)\n2018: \"Stampede\" (feat. Lindsey Stirling)\n2018: \"Waiting for You\"\n2019: \"O Holy Night\"",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Contemporary Singer/Songwriter",
      "Pop"
    ]
  },
  "tracks": [
    "Whiskey and Morphine"
  ],
  "albums": [],
  "similar_artists": [
    "Danger Twins",
    "JAXSON GAMBLE",
    "Eva Under Fire",
    "Tim McMorris",
    "Noisettes",
    "Gin Wigmore"
  ],
  "youtube_videos": [],
  "images": [],
  "lastfm_url": "https://www.last.fm/music/alexander%2bjean"
}