{
  "artist_name": "Black Rebel Motorcycle Club",
  "slug": "black-rebel-motorcycle-club",
  "metadata": {
    "country": "US",
    "genres": "[rock, indie rock, alternative rock, Alternative/Indie Rock, Indie Rock]",
    "active_years": "1998 - present",
    "band_type": "group",
    "lastfm_listeners": 1563048,
    "lastfm_playcount": 46706154,
    "bio": "Black Rebel Motorcycle Club is a rock band from San Francisco, United States. The band formed in 1998. Influences include The Brian Jonestown Massacre, The Verve, The Rolling Stones, Oasis, T. Rex, The Velvet Underground, Love and Rockets, Daniel Ash, and The Jesus and Mary Chain.\n\nThe band's second album 'Take Them On, On Your Own' featured several songs ('Generation' and 'US Government') which were critical of the United States' foreign policy and George Bush in particular. \n\nAfter conflict with their label (Virgin Records), the band was dropped in 2004. Nick Jago left the band at the end of their summer tour in the same year due to \"internal conflict\". \n\nFollowing Jago's departure Peter Hayes and Robert Levon Been regrouped and recorded the band's third album. With their third record Howl, they added blues, folk and gospel, a la Spiritualized.\n\nIn 2005 the band inked a new deal with Echo in the UK, and RCA in the US. Nick Jago also returned to the fold. The band's third album \"Howl\" was released that same year to widespread critical acclaim. Jago returned after most of the album was recorded but played on \"Promise\".\n\n\"Baby 81\" the band's fourth album was released on May 1st, 2007. In June 2008 Nick Jago once again left the touring line-up of the band being replaced by The Raveonettes' touring drummer Leah Shapiro. Nick stated that \"...I am fired again and to be honest with you I respect their decision\". \n\nHowever Hayes and Been released a conflicting joint statement that read \"Nick won't be joining us for the upcoming European tour, but it's not true that he is fired. We just feel Nick needs time to sort out exactly what he wants right now. His heart and all his energy and attention is on his own solo project and he needs to see that through\".\n \nCurrent:\nOn January 9, 2013, the band announced via Facebook the name of their seventh album called Specter at the Feast which was released on March 18 in the UK and Europe and on March 19 in USA, Canada and worldwide. It is considered a tribute to Michael Been (The Call), Robert Levon Been's father who died suddenly on tour with BRMC in August 2010.\n \nIt received mostly positive reviews; many critics noting that despite the band having been together for some time the album showed a mellower and moodier side with songs such as opener `Firewalker'.\nThe band made the first single from the record available, a cover of The Call's 1989 hit \"Let the Day Begin\", for free download on their official website. The decision to record the song was a tribute to Robert's father Michael, who used his experience from The Call to help BRMC before his death in the last couple of years. The single became Q Magazine's track of the day.[6] The band have also released the Let the Day Begin EP for free, consisting of the single and the album track \"Returning\", made available for streaming on the official website.[7]\nOn April 8, 2013 it was announced that the band would play at Rock Werchter, the largest rock festival in Belgium.\n\nThe band continues to show a willingness to tour despite the obstacles. During the 2013 tour, the organisers of the Harvest festival in Australia decided to abandon the multi-city event, of which BRMC were one of the lead acts, only a few months ahead of the performances. BRMC was the first band to announce it would still visit the country and play its own shows.\n\n Many shows on the 2013/2014 tour have sold out.\n\nBRMC's music/songs have been featured in many films, television programs and video games.\n\nVisit blackrebelmotorcycleclub.com for tour/CD and merchandise info. \n\nDiscography:\n2001 - B.R.M.C.\n2001 - Screaming Gun (EP) \n2002 - Spread Your Love (EP)\n2003 - Take Them On, On Your Own\n2005 - Howl\n2006 - Howl Sessions Vol.1 (EP)\n2006 - Howl Sessions Vol. 2 (EP)\n2007 - Baby 81\n2007 - Napster Live Session (EP)\n2007 - American X: Baby 81 Sessions (EP)\n2008 - The Effects Of 333 (Download)\n2010 - Beat the Devil's Tattoo\n2013 - Specter At The Feast\n2018 - Wrong Creatures",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Indie Rock",
      "Noise Pop",
      "Garage Rock Revival",
      "Alternative Pop/Rock"
    ]
  },
  "tracks": [
    "Stop"
  ],
  "albums": [],
  "similar_artists": [
    "The Black Angels",
    "The Dandy Warhols",
    "Band of Skulls",
    "22-20s",
    "The Kills",
    "The Vines"
  ],
  "youtube_videos": [
    {
      "title": "Stop",
      "video_id": "YCcNxwC2f1I"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/YCcNxwC2f1I/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/black%2brebel%2bmotorcycle%2bclub"
}