{
  "artist_name": "d4vd",
  "slug": "d4vd",
  "metadata": {
    "country": "US",
    "genres": "[pop, rnb, dream pop, Indie Pop, Alternative R&B]",
    "active_years": "2005-03-28 - present",
    "band_type": "person",
    "lastfm_listeners": 2178572,
    "lastfm_playcount": 106018084,
    "bio": "David Anthony Burke (born March 28, 2005), known professionally as d4vd, is an American singer and songwriter. He is a content creator for the gaming and lifestyle brand 100 Thieves. He is best known for his songs \"Romantic Homicide\" and \"Here with Me\", both of which experienced international chart success.\n\nBurke's career in music started when he made montage videos of the video game Fortnite and decided to make his own music to prevent himself from receiving copyright strikes. Burke has been a long-standing member of the esports organization Team Limit.\n\nd4vd began releasing music on streaming platforms in November 2021. In the early stages of his music career, he would release rap and indie songs and a drill mixtape named “The Hoodstar Diary.”\n\nBefore his rise to prominence, Burke released his music to SoundCloud, including songs such as ''You and I\" and \"Take Me To the Sun\". Following the song's success on TikTok, he released the single \"Romantic Homicide\" on July 20, 2022. \"Romantic Homicide\" charted at No. 3 on the Hot Alternative Songs charts. The song's success led to Burke being contacted by Darkroom and Interscope Records, leading to his signing with the label in September 2022.\n\nOriginally released to SoundCloud before \"Romantic Homicide\", Burke's next single, \"Here with Me\" was officially released to streaming services in September 2022. The song entered multiple charts following its use on TikTok, most notably at number 60 on the US Billboard Hot 100, and reaching the top ten in Singapore.\n\nBurke's debut EP, Petals to Thorns, was released through Darkroom/Interscope Records on May 26, 2023.\n\nIn March 2024, he joined gaming and lifestyle brand 100 Thieves as a content creator. In the same month, Burke released the single \"Feel It\" for the soundtrack of Amazon Prime Video's television series Invincible.\n\nIn an interview with the Japanese YouTuber Takashii, while Burke was in Japan for Fuji Rock, he stated that anime is \"one of his biggest influences\", specifically citing the \"high energy\" shonen genre, including Dragon Ball Z, Naruto, and My Hero Academia, with its \"fluid, fast-paced movement\", considering the fighting \"poetic\".\n\nBurke released his debut album WITHERED on April 25, 2025.\n\nd4vd often experiments with his sound, making songs with genres like Indie, RnB, Hip-Hop, and Rock.\n\n\"I want d4vd to be a genre in itself, so I try to be as versatile as I can with the sounds that I use and how I convey emotion.\"\n- d4vd\n\nOn September 8, 2025, human remains were discovered in Los Angeles inside of an impounded Tesla car registered to Burke. The body was heavily decomposed, dismembered into several pieces and wrapped inside a plastic bag in the car's front trunk. The body had been inside of the vehicle for an \"extended\" period of time. The car had been towed to the impound lot after being abandoned in the Hollywood Hills; the car had been parked there for at least a month. According to TMZ, the car was not previously reported stolen. On September 16, the local medical examiner publicly identified the body as 15-year-old Celeste Rivas, a girl who went missing on April 5, 2024, when she was 13 years old. TMZ reported that Burke had the same tattoo on his finger as Rivas, and that her mother stated Rivas had a boyfriend named David. Following the identification of the body, TMZ reported that Burke's concert in Seattle (scheduled for September 17) was canceled.",
    "allmusic_styles": [
      "Indie Pop",
      "Alternative R&B",
      "Bedroom Pop",
      "Emo-Pop",
      "Left-Field Pop"
    ]
  },
  "tracks": [
    "Here With Me"
  ],
  "albums": [],
  "similar_artists": [
    "Bryant Barnes",
    "PARIS The Prince",
    "JVKE",
    "Joji",
    "Cafuné",
    "yung kai"
  ],
  "youtube_videos": [
    {
      "title": "Here With Me",
      "video_id": "fwU5Mh-CaOE"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/fwU5Mh-CaOE/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/d4vd"
}