{
  "artist_name": "Dominic Fike",
  "slug": "dominic-fike",
  "metadata": {
    "country": "US",
    "genres": "[indie, indie pop, pop, Left-Field Pop, Pop]",
    "active_years": "1995-12-30 - present",
    "band_type": "person",
    "lastfm_listeners": 2158666,
    "lastfm_playcount": 129642341,
    "bio": "Dominic David Fike (Born December 30, 1995) is an American Singer and Alternative hip-hop artist from Naples, Florida. Fike first received recognition after releasing several popular songs on the website SoundCloud. Following the release of his debut EP, Don't Forget About Me, Demos, he signed to Columbia Records. Fike's song \"3 Nights\" reached the top ten in multiple countries. He later collaborated with the band BROCKHAMPTON and singer Halsey. In June 2020, Fike released the single \"Chicken Tenders\". In July of the same year, he released the single \"Politics & Violence\". Fike's debut album, What Could Possibly Go Wrong, was released the same month. The album charted in the top 50 in multiple countries, including the United States and Australia.\n\nIn September 2020, Fike became a headliner for a concert series in the video game Roblox. A few months later, NME included Fike on their list of essential new artists for 2020. He recorded a cover of Paul McCartney's song \"The Kiss of Venus\" for the album McCartney III Imagined. In 2022, Fike became a cast member of the second season of Euphoria in his first main acting role as Elliot.\n\nDominic David Fike was born on December 30, 1995, in Naples, Florida. Fike grew up with a younger brother, Alex, a sister, Apple, and an older brother, Sean, and is of African-American, Filipino, and Haitian descent. Fike went to Estero High School and graduated in 2014. Fike was a fan of Jack Johnson, Blink-182, and Red Hot Chili Peppers. He first acquired a guitar at the age of ten and learned how to play songs by the Red Hot Chili Peppers.\n\nDuring his childhood, Fike recalled that he and his brothers had to take care of each other owing to his parents' frequent absence from his life. Throughout his childhood, Fike’s mother was in and out of jail, causing him to stay in different homes, including those of his older brother, relatives, or his parents' friends. Fike's childhood life was \"full of adventure,\" as he and his friends would spend time in a forested area near their neighborhood that they called the \"Forest of Avalon,\" where he said they would eat snacks and smoke cannabis. He and his older brother Sean would also hang out at the guest house of his friend Stefan’s home, called the \"Backhouse,\" where they would freestyle. Later, they coalesced into a formal rap collective that included members Slyte, Ike Lysergic, and Seno. They attracted an audience in the community and Fike formed a sub-group called Lame Boys ENT. In 2015, the group started to attract the local media's attention and got booked into music festivals.\n\nFike started uploading songs on the Internet in high school and the first song he uploaded on YouTube was a song called \"Not A Word\". He also put songs he recorded into tapes. Fike briefly enrolled in a college but dropped out in less than 3 days.\n\nFike first received recognition by making beats with his then producer, Hunter Pfeiffer (known as 54) leading to several popular songs on SoundCloud being published. He released his debut EP at the age of 21 in December 2017 as an independent artist, which was recorded while he was on house arrest for the battery of a police officer. He later went to serve time at Collier County Jail for violating that house arrest. The EP caught the attention of several record labels and sparked a bidding war. After being released in April 2018, he signed with Columbia for a reported $4 million in August. All his previous work including the EP was pulled from all streaming services during the bidding war. Fike said the ultimate decision to join a record label was to pay for his mother's lawyer fee, who was facing drug charges at the time.\n\nThe EP was released again by Columbia on October 16, 2018. \"3 Nights\" was released as a single the same year. The single gained wide attention and peaked within the top ten of the charts in Australia, Ireland, and the United Kingdom. It had an acoustic guitar sound compared to the music of Jack Johnson. It was placed on rotation on several radio stations and Spotify playlists and received favorable reviews from outlets such as Rolling Stone, Pitchfork, and Billboard. In reference to the EP, Billboard described Fike as a \"genre-meshing\" artist, and later named him a breakout act to watch, calling \"3 Nights\" a \"Motown-tinged breakout track\" that is \"trend-proof and irresistible\".\n\nIn January 2019, Fike revealed he was working on an album. On April 4, 2019, Brockhampton uploaded a video to their YouTube channel called \"This is Dominic Fike\" which included his song \"3 Nights\". As of April 2019, multiple collaborations with Brockhampton's Kevin Abstract have been posted, reaching over 4 million views.\n\nOn June 7, 2019, he released two singles, \"Açaí Bowl\" and \"Rollerblades\". He followed these with another single, \"Phone Numbers,\" produced by Kenny Beats, on July 4, 2019. The music video for this song was released on October 15, 2019. Fike announced on July 9, 2019, that he would be going on a tour titled Rain or Shine later in the year. The North American leg of the tour began August 31 in Philadelphia and ended October 3 in Los Angeles. In September 2019, he announced that he would be doing a clothing collaboration with Marc Jacobs. On the fifth day of that month, he performed a song that was unreleased at the time, Chicken Tenders, at a Chicago concert during his Rain or Shine tour.\n\nFike is featured on the track Dominic's Interlude on Halsey's third album, Manic, which was released on January 17, 2020. On June 26, 2020, Chicken Tenders, the first single from his then yet-to-be-named debut album, was released. On July 9, he released the single \"Politics & Violence\" and announced that his debut album What Could Possibly Go Wrong would be released on July 31. On August 7, 2020, Fike was the subject of the second episode of The New York Times Presents. In September 2020, Fike became a headliner for the Fortnite concert series. In March 2021, he was featured in the song Die For You by Justin Bieber on his sixth studio album Justice. In August 2021, it was announced that Fike had joined the cast of the HBO teen drama Euphoria for its second season. The initials of the childhood subgroup \"Lame Boys ENT\" are tattooed on his forehead. He also has a tattoo of Red Hot Chili Peppers guitarist John Frusciante's face on his right hand.",
    "allmusic_styles": [
      "Left-Field Pop",
      "Pop",
      "Alternative Rap"
    ]
  },
  "tracks": [
    "Superstar Sh*t"
  ],
  "albums": [],
  "similar_artists": [
    "Bakar",
    "LAUNDRY DAY",
    "Wallows",
    "Malcolm Todd",
    "Between Friends",
    "Jean Dawson"
  ],
  "youtube_videos": [
    {
      "title": "Superstar Sh*t",
      "video_id": "fyxgl96iRR8"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/fyxgl96iRR8/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/dominic%2bfike"
}