{
  "artist_name": "Fkj",
  "slug": "fkj",
  "metadata": {
    "country": "FR",
    "genres": "[electronic, funk, downtempo, Club/Dance, Downtempo]",
    "active_years": "1991-03-27 - present",
    "band_type": "person",
    "lastfm_listeners": 791022,
    "lastfm_playcount": 14203681,
    "bio": "French Kiwi Juice, or FKJ for short, is the moniker of Vincent Fenton, a nod to his Gallic mother and New Zealander father. He grew up in a small French village outside of Tours, isolated from his friends, and so he turned to music for company. He got hooked on his parents’ records by Pink Floyd, Billie Holliday, Nina Simone and Queen, and took up guitar; then, aged seven, the saxophone. “I would play with whatever toys were around, and that helped develop my imagination, and then that evolved into making instruments – I found whatever I could and started putting it together,” he said of his rudimentary one-man bands. \n\nThat one-man-band mentality has persisted, collecting instruments as he goes, though he’s never been formally trained; instead developing his own ear. Prestigious music colleges were too expensive and so he eventually moved to Paris to study the sound and film, which helped give him grounding in cinematic arrangements. He fell into the city’s nightlife scene, playing live instruments in clubs in Paris, and became known as a Soundcloud producer who blended house and jazz, as on his vibey 2013 Time For A Change EP. \n\nBut then in 2015, he played a festival in the Philippines that changed everything. There he met June, who performs as ((( O )))) and who he’d remixed a track for. Eventually they got married and moved in together on an island off the country’s south coast, where they have created a tropical studio idyll that looks out onto lush rainforest. You can see it in the live session FKJ recorded there in 2019 (over 19m views on YouTube), as he flits between piano, singing and sax.\n\nThe seeds for his more introspective sound were sown with his 2017 self-titled debut, while the track that he did with Masego that same year, ‘Tadow’, further evidenced his effortless ear for intriguing rhythms – the pair made the hip-hop-speared jazz jam out of a day-long improvisation in Paris, duelling on their saxophones, their keyboards and drums interlocking effortlessly. There’s an ease to his collaborations – nothing forced; artists who are like-minded about being guided by groove – see the meeting of minds on the track “Risk’ with the American rapper Bas or his latest remix for PinkPantheress. \n\nBut in 2019, FKJ started drawing more from within. He released the Ylang Ylang EP, the result of a tumultuous and devastating year when June miscarried. The couple cancelled their commitments and holed up together to recuperate and make music. The sweepingly romantic jazz of the title track is the EP’s centrepiece, encircled by crisp R&B beats, acoustic guitar flourishes and ambitious sax instrumentals on the other songs. The making of it soothed them as much as it did his growing international fanbase. “With music, I feel safe,” he says. “So when I hear that my music is healing for people, it’s the best compliment.” \n\nBack in the Philippines, with no wifi and an impending global lockdown, FKJ was quite literally cut off from the world, able to explore music’s endless possibilities. “Sometimes I would get into it for the whole night and go to bed when the sun came up.” Out of this freedom comes an expressionistic, touching album that’s impossible to pin down. There’s no more hiding behind a branch of leaves, as he did on the cover of his 2017 debut: V I N C E N T marks FKJ out as a crucial new voice. He’s redefining chillout music with his bursts of late-night jazz sax and piano, coupled with his wood-cabin whispery vocals, recalling Bon Iver’s early work, and those Santana-styled guitar flourishes. \n\nV I N C E N T is a marvel – and testament to the magic that can happen when you dig deep. “This was a challenging record,” he says. “I’m a perfectionist and it’s hard to shake that off. But once I did, and I let the music take over, I felt totally free.”",
    "allmusic_styles": [
      "Club/Dance",
      "Downtempo",
      "House",
      "French House"
    ]
  },
  "tracks": [
    "FKJ & Tom Misch - Losing My Way"
  ],
  "albums": [],
  "similar_artists": [
    "Leisure",
    "Franc Moody",
    "Alina Baraz & Galimatias",
    "Jungle",
    "Neil Frances",
    "Chet Faker"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/fkj-1/800/600",
    "https://picsum.photos/seed/fkj-2/800/600",
    "https://picsum.photos/seed/fkj-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/fkj"
}