{
  "artist_name": "Franz Ferdinand",
  "slug": "franz-ferdinand",
  "metadata": {
    "country": "AT",
    "genres": "[indie rock, indie, rock, Alternative/Indie Rock, Indie Rock]",
    "active_years": "1797-01-31 - 1828-11-19",
    "band_type": "person",
    "lastfm_listeners": 4733190,
    "lastfm_playcount": 175517633,
    "bio": "Franz Ferdinand is a Scottish alternative rock  band that formed in Glasgow, Scotland, United Kingdom, in 2002 and played an important part in the post-punk revival of the 2000s. The band was composed of Alex Kapranos (lead vocals and guitar), Bob Hardy (bass guitar), Nick McCarthy (rhythm guitar, keyboards and backing vocals) and Paul Thomson (drums, percussion and backing vocals) until 2016 when McCarthy left them. The next year  Julian Corrie (keyboards, synthesiser, guitar and backing vocals) and Dino Bardot (guitar and backing vocals) joined the band. As of October 2021, Audrey Tait (drums) has replaced Paul Thomson, after he amicably separated from the band.\n\nThe band first experienced chart success when their second single \"Take Me Out\" reached #3 in the UK Charts, followed by their debut album Franz Ferdinand which entered the UK album chart at #3. The band went on to win the 2004 Mercury Music Prize and two BRIT Awards in 2005 for Best British Group and Best British Rock Act. NME named Franz Ferdinand as their Album of the Year. From the album, three top-ten singles were released, \"Take Me Out\", \"The Dark of the Matinée\" and \"This Fire\". The band has also received several Grammy Award nominations.\n\nThe band is named after Archduke Franz Ferdinand of Austria whose assassination was one of the main reasons for the start of the First World War. The band decided on the name after seeing a racehorse named Archduke Ferdinand win the Northumberland Plate in 2001, eventually coming to the decision as the alliteration and sound of the name appealed to them.\n\n- Discography\nFranz Ferdinand (2004)\nYou Could Have It So Much Better (2005)\nTonight: Franz Ferdinand (2009; and a remix album, 'Blood', released the same year)\nRight Thoughts, Right Words, Right Action (2013)\nFFS (2015); Collaborative album with the band Sparks)\nAlways Ascending (2018)\nHits to the Head  (2022)\nThe Human Fear (2025)",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Indie Rock",
      "New Wave/Post-Punk Revival"
    ]
  },
  "tracks": [
    "Take Me Out",
    "Take Me Out"
  ],
  "albums": [],
  "similar_artists": [
    "FFS",
    "Kaiser Chiefs",
    "The Fratellis",
    "Kasabian",
    "Dirty Pretty Things",
    "Interpol"
  ],
  "youtube_videos": [
    {
      "title": "Take Me Out",
      "video_id": "d11xns8lE4w"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/d11xns8lE4w/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/franz%2bferdinand"
}