{
  "artist_name": "Goo Goo Dolls",
  "slug": "goo-goo-dolls",
  "metadata": {
    "country": "US",
    "genres": "[rock, alternative rock, alternative, Adult Alternative Pop/Rock, Contemporary Pop/Rock]",
    "active_years": "1986 - present",
    "band_type": "group",
    "lastfm_listeners": 1840606,
    "lastfm_playcount": 34813352,
    "bio": "Goo Goo Dolls is an alternative rock band formed in 1985 in Buffalo, New York, USA by guitarist/vocalist John Rzeznik and bassist/vocalist Robby Takac initially under the name the Sex Maggots (the new name was chosen from an ad in True Detective magazine at the behest of a local club owner). They are renowned for the hit \"Iris\", featured on the soundtrack to the 1998 film City of Angels. Currently, the band consists of John Rzeznik (guitar, vocals) and Robby Takac (vocals, bass). The band has sold 12 million records worldwide and won two Grammy Awards.\n\nOriginally a cover band with a taste for power pop and classic rock & roll, the group soon began writing its own songs. Heavily influenced by the band, The replacements, their early sound was a mix of punk and metal. That sound was the reason the band attracted the interest of the heavy metal label Metal Blade, which issued their debut album in 1987 (known either as The Goo Goo girls or First Release). 1989's Jed continued in a similar vein; the college radio breakthrough came with 1990's Hold Me Up.\n\n1993's Superstar Car Wash was the Goo Goo Dolls' artistic breakthrough  and its lead single, \"We Are the Normal,\" was co-written with Replacements leader Paul Westerberg. Still, Superstar Car Wash wasn't the commercial force the band hoped it would be, especially in light of the success of similar bands like the Gin Blossoms. That all changed with 1995's A Boy Named Goo, when an L.A. rock station put the acoustic-driven ballad \"Name\" into heavy rotation. It was eventually released as a single nationwide, and went Top Five late in the year; platinum sales for the album followed close behind. Unfortunately, the original drummer was no longer around to enjoy the band's success; prior to the album's release, he'd been sacked and replaced by drummer Mike Malinin.\n\nDissatisfied with the royalty rates in their Metal Blade contract, the band waged a legal battle that wound up allowing them to jump to parent company Warner Brothers. Somewhat drained, Rzeznik and the band shook off a case of writer's block to contribute the ballad \"Iris\" to the soundtrack of the 1998 americanized version of City of Angels (Featuring Nicolas Cage and Meg Ryan). Appearing that April, the song was a monster smash, although it was never released as a single (so its official Top Ten pop chart status doesn't convey how popular it was); for a better indicator, \"Iris\" spent nearly a year on Billboard's airplay charts, including an astonishing 18 weeks at number one, and was nominated for three Grammys. The band's next album, Dizzy Up the Girl, was released in September, during the middle of \"Iris's marathon airplay run, and sold over three million copies. This track completed the Goo Goo Dolls' transformation into mainstream pop/rockers who had alternative roots. Further hits from the record followed over the next year, including \"Slide,\" \"Dizzy,\" and the Grammy-nominated \"Black Balloon,\" and the band toured heavily in support. The Goo Goo Dolls revamped their sound for 2001's career retrospective, Ego, Opinion, Art & Commerce. A year later, the trio hit the charts with \"Here Is Gone\" from their seventh studio album, Gutterflower. The CD/DVD combo Live in Buffalo: July 4, 2004 helped fans endure the long wait for the band's next studio album, Let Love In, which didn't appear until 2006. The band toured through the summer of 2007. The band released the first of two greatest hits compilation, entitled Greatest Hits Volume One: The Singles, November 13th 2007. \n\nIn August 2010, the band released their ninth album, Something for the Rest of Us. In June 2013, the band's tenth studio album, Magnetic, was released. In December 2013, drummer Mike Malinin announced that he left the band.\n\nIn May 2016, the band released their eleventh studio album, Boxes. The Goo Goo Dolls' 12th studio album, Miracle Pill, was released on September 13, 2019.\n\nOn July 11th 2025, four months after releasing A Boy Named Goo (30th Anniversary Deluxe edition), they released a new track, Nothing Lasts Forever.",
    "allmusic_styles": [
      "Adult Alternative Pop/Rock",
      "Contemporary Pop/Rock",
      "Alternative/Indie Rock",
      "Post-Grunge",
      "Hard Rock"
    ]
  },
  "tracks": [
    "Iris"
  ],
  "albums": [],
  "similar_artists": [
    "Matchbox Twenty",
    "Vertical Horizon",
    "Gin Blossoms",
    "Lifehouse",
    "Hootie & The Blowfish",
    "Better Than Ezra"
  ],
  "youtube_videos": [],
  "images": [],
  "lastfm_url": "https://www.last.fm/music/goo%2bgoo%2bdolls"
}