{
  "artist_name": "Green Day",
  "slug": "green-day",
  "metadata": {
    "country": "US",
    "genres": "[punk rock, rock, punk, Pop Punk, Punk Revival]",
    "active_years": "1989 - present",
    "band_type": "group",
    "lastfm_listeners": 6362081,
    "lastfm_playcount": 421769996,
    "bio": "Green Day is an American rock band formed in Rodeo, California, in 1987, by lead singer and guitarist Billie Joe Armstrong and bassist and backing vocalist Mike Dirnt, with drummer Tré Cool joining in 1990. The band’s major-label debut, \"Dookie,\" released through Reprise Records in 1994, achieved commercial success, eventually shipping over 20 million copies in the United States, and has been credited with renewing mainstream interest in punk rock.\n\nBefore adopting the name Green Day in 1989, the band was known as Sweet Children. They were part of the late 1980s and early 1990s Bay Area punk scene centered around 924 Gilman Street, a club in Berkeley, California. Their early releases were issued through the independent label Lookout! Records, including their first album, \"39/Smooth\" (1990). Green Day has primarily functioned as a power trio, with Tré Cool replacing John Kiffmeyer in 1990 prior to the recording of the band’s second studio album, \"Kerplunk\" (1991). Subsequent albums \"Insomniac\" (1995), \"Nimrod\" (1997), and \"Warning\" (2000) were commercially successful, with \"Insomniac\" and \"Nimrod\" achieving double platinum certification and \"Warning\" reaching gold. Their seventh album, the rock opera \"American Idiot\" (2004), gained widespread popularity among younger audiences and sold six million copies in the United States. The band released \"21st Century Breakdown\" in 2009, followed by a trilogy of albums, \"¡Uno!,\" \"¡Dos!,\" and \"¡Tré!,\" in September, November, and December 2012, respectively. The trilogy underperformed commercially compared with previous releases, attributed in part to limited promotion and Armstrong entering rehab. Later albums include \"Revolution Radio\" (2016), which became their third album to debut at number one on the Billboard 200, \"Father of All Motherfuckers\" (2020), and \"Saviors\" (2024).\n\nIn 2010, a stage adaptation of \"American Idiot\" premiered on Broadway and received three Tony Award nominations, winning for Best Scenic Design and Best Lighting Design. Green Day was inducted into the Rock and Roll Hall of Fame in 2015, their first year of eligibility. Band members have also participated in side projects including Pinhead Gunpowder, the Network, Foxboro Hot Tubs, the Longshot, and the Coverups, in addition to solo work.\n\nAs of 2024, Green Day has sold approximately 75 million records worldwide. The band has received 20 Grammy Award nominations, winning five: Best Alternative Album for \"Dookie,\" Best Rock Album for \"American Idiot\" and \"21st Century Breakdown,\" Record of the Year for \"Boulevard of Broken Dreams,\" and Best Musical Show Album for \"American Idiot: The Original Broadway Cast Recording.\"\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Green_Day\n\nStudio albums\n39/Smooth (1990)\nKerplunk (1991)\nDookie (1994)\nInsomniac (1995)\nNimrod (1997)\nWarning (2000)\nAmerican Idiot (2004)\n21st Century Breakdown (2009)\n¡Uno! (2012)\n¡Dos! (2012)\n¡Tré! (2012)\nRevolution Radio (2016)\nFather of All Motherfuckers (2020)\nSaviors (2024)",
    "allmusic_styles": [
      "Pop Punk",
      "Punk Revival",
      "Alternative/Indie Rock",
      "Alternative Pop/Rock"
    ]
  },
  "tracks": [
    "Basket Case",
    "Holiday",
    "Good Riddance (Time of Your Life)"
  ],
  "albums": [],
  "similar_artists": [
    "Foxboro Hot Tubs",
    "The Network",
    "Pinhead Gunpowder",
    "Billie Joe Armstrong",
    "blink-182",
    "The Longshot"
  ],
  "youtube_videos": [
    {
      "title": "Basket Case",
      "video_id": "gS86jipcKzw"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/gS86jipcKzw/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/green%2bday"
}