{
  "artist_name": "Jet",
  "slug": "jet",
  "metadata": {
    "country": "AU",
    "genres": "[rock, alternative rock, alternative, Alternative/Indie Rock, Garage Punk]",
    "active_years": "2001 - present",
    "band_type": "group",
    "lastfm_listeners": 2610117,
    "lastfm_playcount": 38500966,
    "bio": "Jet found international popularity during the early 2000s, a period in which the band's mix of Exile on Main St. swagger and brash, AC/DC-styled stomp dovetailed nicely with America's garage rock revival. Hailing from Melbourne and comprising guitarist Cameron Muncey, drummer Chris Cester, bassist Mark Wilson, and frontman Nic Cester, the foursome formed just as the new millennium was beginning. They quickly self-released 2002's Dirty Sweet, a vinyl-only EP that proved to be quite popular in Australia. The EP sold out of its initial run of 1,000 copies, and Jet's acclaim grew in the U.K. as they issued another limited-edition run. An American deal with Elektra surfaced in early 2003, and the Dirty Sweet EP was released domestically that May. An opening slot for the Rolling Stones in Jet's homeland soon followed. With buzz brewing about the band's skuzzy, old-fashioned hard rock, Jet's proper studio debut arrived in November under the title Get Born.\n\nWith its crisp guitars and start-stop tempos, \"Are You Gonna Be My Girl?\" became a radio favorite worldwide, and Get Born sold over three million copies as a result. Jet also received seven ARIA (Australian Record Industry Association) nominations, six of which were awarded to the band. European dates with Oasis followed in summer 2005, and the sophomore effort Shine On arrived in fall 2006. The band maintained a steady touring pace and contributed a song to the Spider-Man 3 soundtrack. Following a short break, Jet reconvened in 2008 to begin work on a third album, which arrived one year later as Shaka Rock. They toured as support for Green Day and Powderfinger, but went on hiatus in 2010 and were fully disbanded in 2012. Jet were back in business after several years, however, playing headlining shows in Australia during early 2017.Jet is an alternative rock band which formed in 2001 in Melbourne, Australia. The band consists of Nic Cester (vocals, guitar), Cameron Muncey (guitar, vocals), Mark Wilson (bass) and Chris Cester (drums). They have released three albums: \"Get Born\" (2003), \"Shine On\" (2006) and \"Shaka Rock\" (2009). The band has had international hits with the singles \"Are You Gonna Be My Girl\", \"Look What You've Done\", \"Put Your Money Where Your Mouth Is\" and \"She's A Genius\". The band split in March 2012 but reformed in 2016.\n\nBiography by MacKenzie Wilson\n\nThere are other bands with the same name:\n\n2. Jet were a glam rock band from London. They released one eponymous album in 1975 before splitting up. The band formed in 1974 with a line-up of Andy Ellison (vocals, ex-John's Children, solo artist), Martin Gordon (bass, ex-Sparks), Chris Townson (drums, formerly in John's Children and Jook), David O'List (lead guitar, ex-member of The Nice and an early member of Roxy Music) and Peter Oxendale (keyboards for a short-lived live version of Sparks). The bulk of the band went on to become the punk/new wave band Radio Stars.\n\n3.  Before Black 'N Blue, Jaime St. James began his professional music career while a student at Cleveland High School, where he and classmates Dan Kurth, Barry Pendergrass, and Ray Malsom formed the Molly Hatchet-inspired combo Jet. Jet are featured prominently in the 1977 Legend, the yearbook of Cleveland High School.",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Garage Punk",
      "Hard Rock",
      "American Trad Rock"
    ]
  },
  "tracks": [
    "Are You Gonna Be My Girl"
  ],
  "albums": [],
  "similar_artists": [
    "Wolfmother",
    "Powderfinger",
    "The Raconteurs",
    "Band of Skulls",
    "The Vines",
    "The Fratellis"
  ],
  "youtube_videos": [
    {
      "title": "Are You Gonna Be My Girl",
      "video_id": "mvdTk4ZyQbk"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/mvdTk4ZyQbk/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/jet"
}