{
  "artist_name": "Kelly Clarkson",
  "slug": "kelly-clarkson",
  "metadata": {
    "country": "US",
    "genres": "[pop, female vocalists, pop rock, Pop, Adult Contemporary]",
    "active_years": "1982-04-24 - present",
    "band_type": "person",
    "lastfm_listeners": 4304822,
    "lastfm_playcount": 127014916,
    "bio": "Kelly Brianne (born Kelly Brianne Clarkson on April 24, 1982), known professionally as Kelly Clarkson, is an American singer, songwriter, and television personality. She gained prominence after winning the first season of \"American Idol\" in 2002 and has since maintained a successful career in both music and television. Recognized for her powerful vocals and versatility, Clarkson has been cited by publications such as Rolling Stone and Billboard as one of the greatest singers in history.\n\nAfter signing with RCA Records in 2002, Clarkson released her debut single, \"A Moment Like This,\" which became the best-selling single of the year in the United States. Her debut album, \"Thankful\" (2003), featuring R&B and gospel influences, debuted at number one on the Billboard 200. She transitioned toward a pop rock sound with \"Breakaway\" (2004), one of the best-selling albums of the 21st century. Its singles, including \"Since U Been Gone,\" \"Behind These Hazel Eyes,\" and \"Because of You,\" achieved international success. Following the darker, rock-oriented \"My December\" (2007), Clarkson returned to mainstream pop rock with \"All I Ever Wanted\" (2009) and \"Stronger\" (2011), which produced the number-one singles \"My Life Would Suck Without You\" and \"Stronger (What Doesn’t Kill You).\"\n\nClarkson explored holiday music with \"Wrapped in Red\" (2013), which became the best-selling Christmas album of the year and featured \"Underneath the Tree,\" later recognized by ASCAP as the most popular Christmas song released in the 21st century. Her subsequent releases included \"Piece by Piece\" (2015), \"Meaning of Life\" (2017), \"When Christmas Comes Around...\" (2021), and \"Chemistry\" (2023), the latter marking her final major-label release.\n\nIn addition to her recording career, Clarkson has had a prominent presence on television. She served as a coach on \"The Voice\" for nine seasons between 2018 and 2023, becoming the female coach with the most winning contestants. Since 2019, she has hosted \"The Kelly Clarkson Show,\" earning multiple Daytime Emmy Awards.\n\nClarkson has sold over 82 million records worldwide, making her one of the best-selling artists globally. Her accolades include three Grammy Awards, three MTV Video Music Awards, four American Music Awards, eight Daytime Emmy Awards, and a star on the Hollywood Walk of Fame. Billboard named her the Top Female Artist of 2005 and the 11th most successful female artist of the 21st century. Across her first seven studio albums, she achieved 12 top-ten singles on the Billboard Hot 100 and 10 additional top-ten hits in the United Kingdom, Canada, and Australia. Clarkson became the first artist in history to top each of Billboard’s pop, adult contemporary, country, and dance airplay charts. VH1 ranked her nineteenth on its list of the \"100 Greatest Women in Music.\"\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Kelly_Clarkson\n\nStudio albums\nThankful (2003)\nBreakaway (2004)\nMy December (2007)\nAll I Ever Wanted (2009)\nStronger (2011)\nWrapped in Red (2013)\nPiece by Piece (2015)\nMeaning of Life (2017)\nWhen Christmas Comes Around... (2021)\nChemistry (2023)",
    "allmusic_styles": [
      "Pop",
      "Adult Contemporary",
      "Pop Idol",
      "Teen Pop"
    ]
  },
  "tracks": [
    "Since U Been Gone"
  ],
  "albums": [],
  "similar_artists": [
    "P!nk",
    "Carrie Underwood",
    "Leona Lewis",
    "Ashlee Simpson",
    "JoJo",
    "Christina Aguilera"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/kelly-clarkson-1/800/600",
    "https://picsum.photos/seed/kelly-clarkson-2/800/600",
    "https://picsum.photos/seed/kelly-clarkson-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/kelly%2bclarkson"
}