{
  "artist_name": "L'Impératrice",
  "slug": "limpératrice",
  "metadata": {
    "country": "FR",
    "genres": "[french, synthpop, france, Alternative Dance, Indie Electronic]",
    "active_years": "2012 - present",
    "band_type": "group",
    "lastfm_listeners": 633265,
    "lastfm_playcount": 15153961,
    "bio": "L'Impératrice (French pronunciation: [lɛ̃peʁatʁis]; \"The Empress\") is a project that began in 2012, a French band with a myriad of dreams that have now become reality. However, the vision of each of them has not changed that much as they have become an international band and they claim to keep their feet very firmly on the ground, as, in their words, it is always a work in progress. Despite this, there are still achievements to unlock, one of which is playing at Madison Square Garden, one of their favourite venues.\n\nThe band was initially formed by keyboardist Charles de Boisseguin, who started the project solo until he met the other keyboardist, Hagni Gwon. Gwon later called in bassist David Gaugué and drummer Tom Daveau. Soon after, guitarist Achille Trocellier joined, and the group was officially formed in 2012. In 2015, french singer Flore Benguigui joined the group. After making 3 studio albums and spending 9 years with the band, Flore announced her departure from L'Impératrice in September 2024, citing \"profound personal, artistic, and fundamental disagreements\" between her and the band. Less than a month later, the band revealed their new vocalist Louve.\n\nTheir pop, funk and electronic sounds, Flore's sweet tone singing in French, coupled with a retro yet futuristic aesthetic, broke the language barrier and took them to stages they could never have imagined. After albums and EPs such as \"Sonate Pacifique\", \"Odyssée\", \"Vanille Fraise\" and \"Matahari\", their most recent album is 2024's \"Pulsar\", with songs in English and French, which included collaborations with artists such as Erick the Architect and Maggie Rogers.\n\nL'Impératrice's retro pop and disco music places them as heirs to the French Touch trend pioneered by Daft Punk, to whom they have paid homage in their music videos, and represented by groups such as Air and Phoenix. But in their case, they pride themselves on being a band that doesn't rely so much on synthesizers, but plays their instruments entirely live.\n\nThey once received an email from a fan who congratulated them on their EP L'Odyssée but couldn't understand why on vinyl Flore Benguigui's voice sounded so different from the YouTube videos, almost sounding like a boy. The answer to the mystery: he had been playing the record at the wrong speed. This happy accident led the band to release a slowed-down version of the work.",
    "allmusic_styles": [
      "Alternative Dance",
      "Indie Electronic",
      "Alternative/Indie Rock",
      "Club/Dance",
      "French Pop"
    ]
  },
  "tracks": [
    "Fou",
    "Exit"
  ],
  "albums": [],
  "similar_artists": [
    "Bleu Toucan",
    "The Parcels",
    "Lewis OfMan",
    "Miel De Montagne",
    "Cléa Vincent",
    "Polo & Pan"
  ],
  "youtube_videos": [],
  "images": [],
  "lastfm_url": "https://www.last.fm/music/l%2527imp%25c3%25a9ratrice"
}