{
  "artist_name": "Mamas Gun",
  "slug": "mamas-gun",
  "metadata": {
    "country": "GB",
    "genres": "[soul, funk, UK, Neo-Soul, Soul]",
    "active_years": "2006 - present",
    "band_type": "group",
    "lastfm_listeners": 64783,
    "lastfm_playcount": 653421,
    "bio": "Mamas Gun are a five-piece fronted by the charismatic nay striking singer/composer/producer/designer Andy Platts but they are by no means a one man operation. Bassist ‘Professor’ Rex Horan, another focal point of the band’s feisty stage show, was born in the Western Australian desert and is equally adept on violin and piano and in classical music. Keyboard player Dave ‘Eighties’ Burnell Oliver’s musical education, originally in Hertfordshire, embraced everything from barbershop singing to French horn and now includes jazz, soul and Cuban playing. Guitarist Terry ‘Spiller’ Lewis studied music in Essex, got his diploma and taught guitar, going on to tour with Jools Holland as part of brother Christopher Holland’s band. And ‘Union’ Jack Pollitt notably played drums on ‘Green Light’ for Beyoncé’s ‘B-Day’ album, with producer Pharrell Williams.\n\nHaving said all that, one should take a deep breath before contemplating main-man Platt’s cultural and musical heritage. Born in a military hospital in Kowloon, Hong Kong, to a nomadic father who’d landed in the Far East as a police recruit in their battles with underground triad organisations, Platts soaked up the musical ether that surrounded him (which included the Beatles, the Doors and ELO from his father, and a Filipino mother who played Spanish-influenced guitar), attending countless schools in the process before winning a place at Liverpool’s LIPA institute. Subsequently, Platts played on Corinne Bailey Rae’s hugely successful debut album and then, in 2006, landed his own publishing deal with Zomba Music. This led to collaborations with an extraordinary song-writing A-list that included Rod ‘Thriller’ Temperton, John Oates, Jed Leiber (son of hit-making legend Jerry) and former Gil Scott-Heron collaborator Brian Jackson.\n\nIn March 2010 Mamas Gun release their 'Deluxe' version of their debut album Routes To Riches. Coproduced by Julian Simmons (Guillemots), mixed by Grammy Award-winning producer/engineer Jack Joseph Puig (Black Eyed Peas, U2, the Rolling Stones) and mastered by the equally notable Bob Ludwig, Routes To Riches manages to combine the euphoria of soul and Motown music with the spirit of Stevie Wonder, Marvin Gaye, Lewis Taylor and the Average White Band at their blue-eyed-soul best. The record is also all about musical enjoyment and nothing to do with the fleets of fashion and this “philosophy” has obviously already hit a nerve as the band have achieved play-list status for their first two singles on the BBC Radio 2 play-list & enjoyed an Album Of The Week feature on the Smooth radio network. More interestingly perhaps, Mamas Gun are currently having a huge impact in Japan where 2009 saw them heralded as the most played international act in the country. The band also managed to achieve the No.3 sales slot on the Japanese Billboard charts, beating Madonna to No. 1 in the airplay charts whilst doing so. Naturally, with a talisman like Platts at the helm and a live show that can simply be described as breathtaking, there’s every reason to think that the band’s success in Japan is about to be replicated in the UK.\n\nOn March 1st Mamas Gun release a new single called Wishing. This stunning Hall and Oates-tinged masterstroke features on the ‘deluxe’ version of Routes To Riches and will be released as a double A-side along with another track lifted from the album, the delightfully dirty ‘Groove is in the heart’ vibe ‘Finger On It’.",
    "allmusic_styles": [
      "Neo-Soul",
      "Soul",
      "Alternative R&B"
    ]
  },
  "tracks": [
    "This Is The Day"
  ],
  "albums": [],
  "similar_artists": [
    "Young Gun Silver Fox",
    "Mayer Hawthorne",
    "Izo FitzRoy",
    "Delv!s",
    "Wildson",
    "Incognito"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/db19f5d567ff4067c0ea6b9444f73bfb.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/b5e9752e909aee1073aa69f7d0ae1827.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/67bc6113a5759ecbb577276dec453e2d.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/mamas%2bgun"
}