{
  "artist_name": "Marié Digby",
  "slug": "marié-digby",
  "metadata": {
    "country": "US",
    "genres": "[female vocalists, pop, singer-songwriter, Contemporary Singer/Songwriter, Contemporary Pop/Rock]",
    "active_years": "1983-04-16 - present",
    "band_type": "person",
    "lastfm_listeners": 187259,
    "lastfm_playcount": 2176905,
    "bio": "Marié Digby is a singer-songwriter, guitarist and pianist from Los Angeles, California. She was born April 16th, 1983 in New York and grew up in LA. Her father is Irish American, and her mother is Japanese.\n\nDigby, had a normal childhood, but was always a little shy, feeling more comfortable hiding under the bleachers during high school football games than in front of a crowd. She started playing the piano when she was just four years old, and began to secretly write songs later 'after everyone had gone to sleep', even hiding them from her family.\n\nWhile a senior in high school, the timid and nervous Marié Digby signed up for a talent show. Although she was nervous to perform, she went on anyway and the audience loved it. This would be the first of many performances.\n\nShe began University of California at Berkely in 2002 as a philosophy major. She was on the three-day schedule (she took all her classes in three days) so she would have more time to play with the new band she had formed. She was performing all over the Los Angeles area, including places such as the infamous Whiskey a Go Go and The Troubadour.\n\nIn 2004, the quiet Digby came out of obscurity into the public eye when she won the 2004 Pantene Pro-Voice competition with her song “Miss Invisible” (a song about growing up and feeling like you do not belong). The grand prize for the concert included working with a professional producer on an album, $5,000 and performing on stage with other top performers.\n\nIn 2006, the song “Fool” appeared on the Disney compilation album Girl Next, which includes many of today’s Radio Disney Stars such as Hilary Duff, Aly and AJ and Hannah Montana.\n\nBiography by Ian Ripley, PopStarsPlus.com, Sr. Staff Writer, copied with permission from PopStarsPlus.com\n\nShe is currently signed to Hollywood Records and her debut album “Unfold” was released on April 8, 2008.\n\nShe released her first Japanese cover album, \"Second Home\" on March 4, 2009. She toured Japan, performed on radios and live shows to promote her album.\n\nDigby released her sophomore album, \"Breathing Underwater\" to Japan + Asia (June 23, 2009) and the rest of the world (September 15, 2009).",
    "allmusic_styles": [
      "Contemporary Singer/Songwriter",
      "Contemporary Pop/Rock"
    ]
  },
  "tracks": [
    "Umbrella"
  ],
  "albums": [],
  "similar_artists": [
    "Ryan Cabrera",
    "Michelle Branch",
    "Kate Voegele",
    "Vanessa Carlton",
    "Erin McCarley",
    "Anna Nalick"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/54852040f0514fd4b97fd9d6bfc5c922.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/21eff22a1ac141dcc16c7260e3a86b51.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/504776b462109c1ac8a77e7ea6a786f0.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/mari%25c3%25a9%2bdigby"
}