{
  "artist_name": "Masego",
  "slug": "masego",
  "metadata": {
    "country": "US",
    "genres": "[jazz, rnb, soul, Alternative R&B, Club/Dance]",
    "active_years": "1993-06-08 - present",
    "band_type": "person",
    "lastfm_listeners": 989332,
    "lastfm_playcount": 19201666,
    "bio": "Micah Davis (born June 8, 1993), better known by his stage name Masego, is a Jamaican-American musician with South African roots. Masego is an international, contemporary genre bending entertainer who refers to his own music style as \"TrapHouseJazz\" or Emotion. He released his first album \"Loose Thoughts\" in 2016, but it was his collaborative record “Tadow” that has amassed over 47 million views on Youtube (508 million as of January 2025) and gained him international recognition. His record Navajo, first premiered by Berlin platform “Colors” has been streamed over 20 million times (69 million as of January 2025), triggering a worldwide sold out tour. \nOn September 7, 2018, he released his album Lady Lady, including guest features from FKJ, SiR, Tiffany Gouché, and De' Wayne Jackson. The album featured the previously released \"Tadow\" as its lead single.\nHis EP, Studying Abroad was released on November 13, 2020, of which he later released a deluxe/extended version called: Studying Abroad: Extended Stay. Masego released his self-titled album on March 3, 2023 with lead singles being: Say You Want Me, You Never Visit Me and Two Sides (I'm So Gemini). Masego lost his house in Los Angeles during the California fires at the beginning of 2025.",
    "allmusic_styles": [
      "Alternative R&B",
      "Club/Dance",
      "Downtempo",
      "House"
    ]
  },
  "tracks": [
    "Tadow (Extended Version)"
  ],
  "albums": [],
  "similar_artists": [
    "SiR",
    "Enny",
    "Rayana Jay",
    "Xavier Omär",
    "BLK ODYSSY",
    "Lucky Daye"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/masego-1/800/600",
    "https://picsum.photos/seed/masego-2/800/600",
    "https://picsum.photos/seed/masego-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/masego"
}