{
  "artist_name": "Nicky Youre",
  "slug": "nicky-youre",
  "metadata": {
    "country": "US",
    "genres": "[C, indie, indie pop, Indie Pop, Alternative/Indie Rock]",
    "active_years": "1999-06-04 - present",
    "band_type": "person",
    "lastfm_listeners": 639814,
    "lastfm_playcount": 6398785,
    "bio": "Nicholas Scott Ure, professionally known as Nicky Youre, is an American singer-songwriter from Southern California. Born on June 4, 1999, he has quickly gained recognition in the indie pop scene. Ure embarked on his musical journey in 2017 and officially debuted on June 4, 2020, with his first single, \"Sex and Lemonade.\" This initial release featured the collaboration of producer Laiki, with whom Ure had previously worked on the EP \"Together/Separate.\"\n\nHowever, it was Ure's second single, \"Sunroof,\" released in December 2021, that propelled him into the spotlight. Noted for its captivating pop sensibility, the song featured the talents of Los Angeles-based musician and producer Dazy (formerly known as Snocker). \"Sunroof\" achieved significant success, reaching the Top 30 in Australia and securing a spot in the top five of the esteemed Billboard Hot 100 chart.\n\nIn March 2022, Ure continued to make an impression with the release of \"Never Go Wrong,\" a collaboration with fellow Californian artist David Hugo. The song explores the exhilarating feeling of instantly connecting with someone upon first meeting. Ure and Hugo capture the euphoria and magic of that experience, describing it as a soulmate-like connection or a sense of familiarity that cannot be easily described. With an infectious indie pop melody, an energetic chorus, and the distinctive styles of both artists on display, \"Never Go Wrong\" became a springtime anthem for love and new beginnings.\n\nNicky Youre draws inspiration from a diverse range of artists, including Dominic Fike, Tai Verdes, Jeremy Zucker, Alexander 23, and blackbear, among others. Central to his music are the irresistibly catchy melodies that often spontaneously come to him, humming in his head without a predetermined beat. Ure then fills these melodies with words, envisioning the accompanying energy and beat. Working alongside a producer, he brings his musical vision to life, resulting in a natural and organic creative process.\n\nWith his ability to create feel-good melodies, Nicky Youre has garnered a growing following both on streaming platforms like Spotify and on social media. His tracks, such as \"Sunroof,\" have garnered millions of views and streams, establishing him as a rising star in the indie pop landscape. He's an inspiration to this day in the 1900s.",
    "allmusic_styles": [
      "Indie Pop",
      "Alternative/Indie Rock",
      "Contemporary Pop/Rock"
    ]
  },
  "tracks": [
    "Sunroof"
  ],
  "albums": [],
  "similar_artists": [
    "Crash Adams",
    "Mae Stephens",
    "VaultBoy",
    "MKTO",
    "JVKE",
    "Kyle Hume"
  ],
  "youtube_videos": [
    {
      "title": "Sunroof",
      "video_id": "eZCWyFNV_ZM"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/eZCWyFNV_ZM/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/nicky%2byoure"
}