{
  "artist_name": "Nine Days",
  "slug": "nine-days",
  "metadata": {
    "country": "US",
    "genres": "[alternative rock, rock, alternative, Alternative Pop/Rock, Alternative/Indie Rock]",
    "active_years": "1988 - present",
    "band_type": "group",
    "lastfm_listeners": 588938,
    "lastfm_playcount": 4816411,
    "bio": "Nine Days is a power pop/rock band that was popular in the early 00s. Formed in New York by musicians John Hampson and Brian Desveaux in 1994, they released three albums independently during the 90s before their mainstream debut album, 'The Madding Crowd', was released in 2000. Their greatest popularity came from a handful of songs from said album (which took its title from the 1874 romantic drama novel 'Far From the Madding Crowd') such as the tracks \"Absolutely (Story of a Girl)\" and \"If I Am\".\n\nStylistically, the band took influence from both contemporary adult alternative bands as well as earlier power pop and Bob Dylan-like singer-songwriter music. 'The Madding Crowd' generally received positive critical reviews and reached the #67 slot on the Billboard 200, eventually being certified as gold by the RIAA. Yet Nine Days' acclaim ended up being brief. Despite the popularity of \"Absolutely (Story of a Girl)\", which reached the #1 slot on Billboard's 'Top 40 Mainstream' chart and raced up in other charts, the group's mainstream success quickly faded, and they became saddled with the \"one hitwonder\" tag because of that single's ubiquitous nature. They're also sometimes labeled as a \"two hit wonder\" (due to the major airplay of \"If I Am\" as well).\n\nTheir next album, 'So Happily Unsatisfied', was scheduled for a release in 2002. Unfortunately due to complications with their label, Sony Records, this album became delayed and the group was no longer in possession of the rights of the songs. They managed to put it up for online distribution years later after acrimonious conflict. 'Flying the Corporate Jet', released in 2003 by the band by itself, ended up being Nine Days' last full album for some time.\n\nJustly feeling bashed by the music industry, the band went on hiatus through much of the decade. However, In mid-August 2006, Nine Days formally reunited and went back to the studio to record. 'Slow Motion Life (Part One)', a new EP with six songs, was released on January 19, 2007. Part Two was released later that year. Their more recent work has gone in a more Americana type musical direction.\n\nThe band has since performed sporadically. Both vocal artists, John Hampson and Brian Desveaux have pursued solo careers and their music is available for purchase from their respective websites. According to the Absolutely (Story of a Girl) Songfacts, Hampson ended up spending a lot of time as a high school English teacher.",
    "allmusic_styles": [
      "Alternative Pop/Rock",
      "Alternative/Indie Rock",
      "Hard Rock"
    ]
  },
  "tracks": [
    "Absolutely (Story of a Girl) (Radio Mix)",
    "Absolutely (Story of a Girl)"
  ],
  "albums": [],
  "similar_artists": [
    "Vertical Horizon",
    "Stroke 9",
    "Matchbox Twenty",
    "Third Eye Blind",
    "Sister Hazel",
    "EVE 6"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/nine-days-1/800/600",
    "https://picsum.photos/seed/nine-days-2/800/600",
    "https://picsum.photos/seed/nine-days-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/nine%2bdays"
}