{
  "artist_name": "Oasis",
  "slug": "oasis",
  "metadata": {
    "country": "GB",
    "genres": "[britpop, rock, british, Alternative Pop/Rock, Alternative/Indie Rock]",
    "active_years": "1991 - present",
    "band_type": "group",
    "lastfm_listeners": 5682977,
    "lastfm_playcount": 308673231,
    "bio": "Oasis is an English alternative rock band formed in Manchester in 1991. Originally known as the Rain, the group initially consisted of Liam Gallagher (lead vocals, tambourine), Paul Arthurs (guitar), Paul McGuigan (bass guitar) and Tony McCarroll (drums). Liam's older brother Noel (lead guitar, vocals) later joined as a fifth member, finalising the group's core lineup. During the course of their existence, they had various lineup changes, with the Gallagher brothers remaining the only staple members.\n\nOasis signed to independent record label Creation Records in 1993 and released their record-setting debut album Definitely Maybe (1994). The following year they recorded (What's the Story) Morning Glory? (1995) with drummer Alan White, in the midst of a chart rivalry with peers Blur. Spending ten weeks at number one on the UK Albums Chart, (What's the Story) Morning Glory? was also an international chart success and became one of the best-selling albums of all time. In addition, it stands as the fifth-best-selling album in the UK and the biggest-selling album in the UK of the 1990s. The Gallagher brothers featured regularly in tabloid newspapers for their disputes and wild lifestyles. In 1996, Oasis performed two nights at Knebworth for an audience of 125,000 each time, the largest outdoor concerts in UK history at the time. In 1997, Oasis released their third album, Be Here Now. It became the fastest-selling album in UK chart history.\n\nOasis' popularity later declined and McGuigan and Arthurs left in 1999 as Oasis released Standing on the Shoulder of Giants (2000). They were replaced by former Heavy Stereo guitarist Gem Archer and former Ride guitarist Andy Bell. White departed in 2004, replaced by Zak Starkey and later Chris Sharrock. Oasis released three more studio albums, Heathen Chemistry (2002), Don't Believe the Truth (2005) and Dig Out Your Soul (2008). The group abruptly disbanded after the departure of Noel Gallagher in August 2009.\n\nAs of 2009, Oasis had sold over 70 million records worldwide. They are among the most successful acts on the UK Singles Chart and Albums Chart, with eight UK number-one singles and eight UK number-one albums. The band also achieved three platinum albums in the US. They won 17 NME Awards, nine Q Awards, four MTV Europe Music Awards and six Brit Awards, including one in 2007 for Outstanding Contribution to Music and one for the \"Best Album of the Last 30 Years\" for (What's the Story) Morning Glory?. They were nominated for two Grammy Awards.\n\nOn 27th August 2024, the Gallagher brothers confirmed Oasis would reunite for a series of concerts across the United Kingdom and Ireland in summer 2025.\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Oasis_(band)\n\nStudio albums\nDefinitely Maybe (1994)\n(What's the Story) Morning Glory? (1995)\nBe Here Now (1997)\nStanding on the Shoulder of Giants (2000)\nHeathen Chemistry (2002)\nDon't Believe the Truth (2005)\nDig Out Your Soul (2008)\n\nMembers:\nLiam Gallagher – vocals (1991–2009; 2025–)\nNoel Gallagher – lead guitar, vocals (1991–2009; 2025–)\nPaul Arthurs - rhythm guitar (1991–1999; 2025–)\nGem Archer – rhythm guitar (1999–2009; 2025–)\nPaul McGuigan – bass guitar (1991–1999)\nAndy Bell (Oasis) – bass guitar (1999–2009; 2025–)\nTony McCarroll – drums (1991–1995)\nAlan White (Oasis) – drums (1995–2004)\nZak Starkey – drums (2004–2008)\nChris Sharrock – drums (2008–2009)\nJoey Waronker – drums (2025-)",
    "allmusic_styles": [
      "Alternative Pop/Rock",
      "Alternative/Indie Rock",
      "British Trad Rock",
      "Britpop",
      "Contemporary Pop/Rock"
    ]
  },
  "tracks": [
    "Don't Look Back in Anger (Remastered)"
  ],
  "albums": [],
  "similar_artists": [
    "Liam Gallagher",
    "Noel Gallagher's High Flying Birds",
    "Beady Eye",
    "Noel Gallagher",
    "The Stone Roses",
    "The Verve"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/08300481d8484150c13b769007cac3ef.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/11030af5abc644acafdd0adbb6924610.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/cb09fbd7d5107d3bebbcdf0ce09802a7.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/oasis"
}