{
  "artist_name": "Pinkpantheress",
  "slug": "pinkpantheress",
  "metadata": {
    "country": "GB",
    "genres": "[2-step, electronic, rnb, Left-Field Pop, Alternative R&B]",
    "active_years": "2001-04-19 - present",
    "band_type": "person",
    "lastfm_listeners": 2681489,
    "lastfm_playcount": 258711796,
    "bio": "PinkPantheress (Victoria Beverley Walker, born 19 April 2001) is a British singer-songwriter and record producer. Her music is noted for its use of samples and personal, diaristic lyrics.\n\nBorn in Bath, Somerset, and raised in Kent, she began her musical career in 2021 while attending university in London, producing songs using GarageBand and sharing them on SoundCloud and TikTok. Tracks such as \"Break It Off\" gained popularity on TikTok, leading to her signing with Parlophone and Elektra Records and the release of her debut mixtape \"To Hell with It\" in 2021. She won BBC's Sound of 2022 poll after singles \"Just for Me\" and \"Pain\" reached the top 40 of the UK Singles Chart. Her 2022 single \"Boy's a Liar\" reached number two in the UK.\n\nHer debut studio album, \"Heaven Knows\" (2023), included the UK top-20 song \"Nice to Meet You\" and \"Boy's a Liar Pt. 2\", a remix of \"Boy's a Liar\" with American rapper Ice Spice, which peaked at number three on the Billboard Hot 100. The album was supported by her headlining Capable of Love Tour in 2024. Her second mixtape, \"Fancy That\" (2025), produced the UK top-40 singles \"Tonight\" and \"Illegal\".\n\nPinkPantheress has received nominations for three Brit Awards and was named Producer of the Year by Billboard Women in Music in 2024. Her songs, often brief in length and incorporating samples from 1990s and 2000s music, encompass genres including alt-pop, bedroom pop, drum and bass, and 2-step garage.",
    "allmusic_styles": [
      "Left-Field Pop",
      "Alternative R&B",
      "Bedroom Pop",
      "UK Garage",
      "Indie Electronic"
    ]
  },
  "tracks": [
    "Picture in My Mind"
  ],
  "albums": [],
  "similar_artists": [
    "Addison Rae",
    "Rochelle Jordan",
    "Lil Hero",
    "Erika de Casier",
    "Doja Cat",
    "Jade"
  ],
  "youtube_videos": [
    {
      "title": "Picture in My Mind",
      "video_id": "r23tQvESL7w"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/r23tQvESL7w/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/pinkpantheress"
}