{
  "artist_name": "PLACEBO",
  "slug": "placebo",
  "metadata": {
    "country": "GB",
    "genres": "[alternative rock, alternative, rock, Alternative Pop/Rock, Alternative/Indie Rock]",
    "active_years": "1994 - present",
    "band_type": "group",
    "lastfm_listeners": 3371688,
    "lastfm_playcount": 268679190,
    "bio": "There are at least four artists with the name Placebo:\n\n1) Placebo is a British alternative rock duo formed in London in 1994 by vocalist-guitarist Brian Molko and bassist-guitarist Stefan Olsdal. Drummer Robert Schultzberg joined in late 1994 but left in 1996 shortly after the release of the band's eponymous debut album due to conflicts with Molko. He was replaced the same year by Steve Hewitt. Molko was born in Belgium, and Olsdal and Schultzberg were born in Sweden. Remaining members Molko and Olsdal both grew up in Luxembourg before separately relocating to London and are both British citizens.\n\nFollowing the release of a demo, a split single, and their eponymous debut album, Placebo gained exposure in 1997 after the single \"Nancy Boy\" became popular in the UK, a song notorious at the time for its gender-bending content. The band stood out among the Britpop scene they were associated with at the time for their androgynous appearance and musical content, as well as Molko's distinctive voice and lyrics which openly discussed sexuality, mental health, and drug use.\n\nHewitt left Placebo in 2007 due to personal and musical differences. He was replaced the following year by Steve Forrest. Placebo released two albums with Forrest, who left in 2015 to pursue his own musical career. Since 2015, Placebo has been officially a duo, though augmented with additional musicians.\n\nPlacebo has collaborated with various artists over the years, including David Bowie, Justin Warfield, Michael Stipe, and Alison Mosshart. To date, Placebo has released eight studio albums, all of which have reached the Top 20 in the United Kingdom, and have sold around 14 million records worldwide.\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Placebo_(band)\n\nDiscography\nPlacebo (1996)\nWithout You I'm Nothing (1998)\nBlack Market Music (2000)\nSleeping with Ghosts (2003)\nMeds (2006)\nBattle for the Sun (2009)\nLoud Like Love (2013)\nNever Let Me Go (2022)\n\n----------\n\n2) Placebo is a Jazz Rock/Jazz fusion band from Belgium who released three LPs in the early '70s. Their members were performing with Aksak Maboul, Larry Coryell, Focus, Telex, and Cos.\n\n----------\n\n3) Placebo is a female-fronted British Post-Punk/New Wave band from the early '80s who had two LPs and two 45s out.\n\n----------\n\n4) Placebo is a four-piece rock band from Calgary, AB, Canada, fronted by Leslie Feist. Other members included Kieran McAuley on guitar, Elescia on bass, and Toby on drums. This information is based on the liner notes of their CD \"Don't Drink the Bathwater,\" released in 1994 on Cry Baby Records. After discovering the UK Placebo, they renamed the band Placebo4 for the 1996 release of their 7-inch \"Sailor Boy,\" also on Cry Baby Records. Dale Becker on drums.",
    "allmusic_styles": [
      "Alternative Pop/Rock",
      "Alternative/Indie Rock",
      "Neo-Glam",
      "Britpop"
    ]
  },
  "tracks": [
    "Every You Every Me"
  ],
  "albums": [],
  "similar_artists": [
    "Muse",
    "Garbage",
    "30 Seconds to Mars",
    "Pixies",
    "Interpol",
    "Editors"
  ],
  "youtube_videos": [
    {
      "title": "Every You Every Me",
      "video_id": "WzHKEehcrEY"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/WzHKEehcrEY/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/placebo"
}