{
  "artist_name": "Primary",
  "slug": "primary",
  "metadata": {
    "country": "JP",
    "genres": "[japanese, doujin, Korean]",
    "active_years": "2005 - present",
    "band_type": "group",
    "lastfm_listeners": 198277,
    "lastfm_playcount": 3352030,
    "bio": "There are at least five artists by this name:\n\n1. Primary (프라이머리), a south Korean hip-hop producer under the label, Amoeba Culture.\n\n2. Japanese doujin music circle, led by yuiko: http://primary-yuiko.com/\n\n3. Primary, a band from Sydney, Australia, featuring former members of Caligula and Def FX and lead singer Connie Mitchell (now Sneaky Sound System), were an electronic-rock band with two released albums, Watching The World (2003) and This Is The Sound (1999).\n\nTracks such as Vicious Precious, Young and Brazilian attracted national airplay on alternative station Triple J in 1998 and 1999. They toured extensively (including Big Day Out and Homebake) and established a strong reputation for their individual style.\n\n4. PRIMARY is the axiom to their music and the music industry itself. The importance of truth and relevance in the lyrics exist on an emotional plane which continues to be the most powerful element to their success.\nPRIMARY the band was formed in the spring of 2003, and played their first live show together summer of the same year. This five piece band continued to work very hard writing songs and performing to packed venues. In the Fall of 2003 PRIMARY started pre-production on their first 5-song demo which included the song titled, “I Don’t Know”. Phoenix, Arizona's own 98 KUPD (Larry Mac) was the first to spin this track off their Demo disc for eight consecutive weeks. The band received wide acclaim for it’s fresh modern style and diverse rhythmic progressions. PRIMARY continued it’s relentless touring schedule, playing many different shows and venues, when in 2004 they met and joined forces with producer Ken Mary of “Sonicphish Studios” (Sonicphish.com) at the NAMM show in Anaheim, California. As soon as producer Ken Mary heard PRIMARY’S Demo, they immediately started working on the full-length CD titled “FEEL THE PAIN”. The CD was said to be an emotional and metaphorical look at real events, through the eyes of each of the members of PRIMARY. The final mix was completed in 2005, mastered by Precision Mastering, then printed. Currently an unsigned band, PRIMARY’s popularity continues to grow rapidly through word of mouth and the buzz they have created on MySpace.com.\n\n5. Primary is a Post-Punk/Dark Punk band from San Francisco, California . https://primarypunx.bandcamp.com/releases"
  },
  "tracks": [
    "Johnny (Feat. Dynamicduo)"
  ],
  "albums": [],
  "similar_artists": [
    "Yankie",
    "Drunken Tiger",
    "MFBTY",
    "Dynamic Duo",
    "Tablo",
    "Beenzino"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/9367e645a8697507ae227af54a70959a.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/b126883c6ddb34380a4f25a357dc6bab.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/64bfb52e5fed3775434afdfd719cf1b3.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/primary"
}