{
  "artist_name": "Red Hot Chili Peppers",
  "slug": "red-hot-chili-peppers",
  "metadata": {
    "country": "US",
    "genres": "[rock, alternative rock, Funk Rock, Alternative Pop/Rock, Alternative/Indie Rock]",
    "active_years": "1983 - present",
    "band_type": "group",
    "lastfm_listeners": 7026572,
    "lastfm_playcount": 536172514,
    "bio": "The Red Hot Chili Peppers is an American rock band formed in Los Angeles in 1982, consisting of Anthony Kiedis (vocals), Flea (bass), John Frusciante (guitar), and Chad Smith (drums). Their music blends elements of alternative rock, funk, punk rock, hard rock, hip hop, and psychedelic rock, and they have influenced genres such as funk metal, rap metal, rap rock, and nu metal. With over 120 million records sold worldwide, the Red Hot Chili Peppers are among the best-selling bands in history. They hold records for the most number-one singles on the US Billboard Alternative Songs chart (15), the most cumulative weeks at number one (91), and the most top-ten songs (28). The band has won three Grammy Awards, was inducted into the Rock and Roll Hall of Fame in 2012, and received a star on the Hollywood Walk of Fame in 2022.\n\nThe band was founded by Kiedis, Flea, guitarist Hillel Slovak, and drummer Jack Irons. Due to other commitments, Slovak and Irons did not appear on their self-titled debut album \"The Red Hot Chili Peppers\" (1984), which instead featured guitarist Jack Sherman and drummer Cliff Martinez. Slovak returned for the second album, \"Freaky Styley\" (1985), and Irons rejoined for the third, \"The Uplift Mofo Party Plan\" (1987). Irons left the band following Slovak’s death from a drug overdose in 1988.\n\nWith Frusciante and Smith joining shortly after, the Red Hot Chili Peppers released \"Mother’s Milk\" (1989) and their first major commercial success, \"Blood Sugar Sex Magik\" (1991). Frusciante left the group during their 1992 tour, struggling with the band’s sudden fame. After working with several guitarists, the band recruited Dave Navarro, who played on \"One Hot Minute\" (1995). The album did not replicate the success of its predecessor, and both Frusciante and Kiedis faced issues with drug addiction during the decade.\n\nFrusciante rejoined the group in 1998, and their seventh album, \"Californication\" (1999), became their most commercially successful, selling over 16 million copies worldwide. The follow-up albums \"By the Way\" (2002) and \"Stadium Arcadium\" (2006) were also highly successful, with \"Stadium Arcadium\" reaching number one on the Billboard 200. Frusciante left again in 2009 to pursue a solo career and was replaced by Josh Klinghoffer, who performed on \"I’m with You\" (2011) and \"The Getaway\" (2016). Frusciante rejoined in 2019, and in 2022 the band released their twelfth and thirteenth studio albums, \"Unlimited Love\" and \"Return of the Dream Canteen.\"\n\nStudio albums\nThe Red Hot Chili Peppers (1984)\nFreaky Styley (1985)\nThe Uplift Mofo Party Plan (1987)\nMother's Milk (1989)\nBlood Sugar Sex Magik (1991)\nOne Hot Minute (1995)\nCalifornication (1999)\nBy the Way (2002)\nStadium Arcadium (2006)\nI'm with You (2011)\nThe Getaway (2016)\nUnlimited Love (2022)\nReturn of the Dream Canteen (2022)",
    "allmusic_styles": [
      "Alternative Pop/Rock",
      "Alternative/Indie Rock",
      "Adult Alternative Pop/Rock",
      "Funk Metal"
    ]
  },
  "tracks": [
    "Can't Stop",
    "By the Way",
    "Aquatic Mouth Dance",
    "Snow (Hey Oh)",
    "Dani California",
    "Otherside"
  ],
  "albums": [],
  "similar_artists": [
    "John Frusciante",
    "Foo Fighters",
    "Audioslave",
    "Incubus",
    "Ataxia",
    "Jane's Addiction"
  ],
  "youtube_videos": [
    {
      "title": "Can't Stop",
      "video_id": "D4INE2zO9OU"
    },
    {
      "title": "By the Way",
      "video_id": "O-A7It0bZ2w"
    },
    {
      "title": "Aquatic Mouth Dance",
      "video_id": "n02SbZGaTUg"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/D4INE2zO9OU/maxresdefault.jpg",
    "https://i.ytimg.com/vi/O-A7It0bZ2w/hqdefault.jpg",
    "https://i.ytimg.com/vi/n02SbZGaTUg/hqdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/red%2bhot%2bchili%2bpeppers"
}