{
  "artist_name": "Royal Blood",
  "slug": "royal-blood",
  "metadata": {
    "country": "GB",
    "genres": "[rock, Garage Rock, alternative rock, Alternative/Indie Rock, Indie Rock]",
    "active_years": "1946 - present",
    "band_type": "orchestra",
    "lastfm_listeners": 1030518,
    "lastfm_playcount": 41038300,
    "bio": "There are several artists with this name:\n---\n1) Formed at the beginning of 2011, Royal Blood is a 2-piece band from Worthing, West Sussex, UK. Having known each other for years in different bands, Mike Kerr (Bassist/Vocalist) & Ben Thatcher (Drums) finally came together and went into the studio to record ‘Figure It Out’ – the first track that brought attention to the band. At the tail end of 2013, Royal Blood released ‘Out of The Black’, their debut single on Black Mammoth Records. \n\nThe band released their debut album ''Royal Blood’' on 22 August, 2014 which sold 66,000 copies in its first week.\n---\n2) Royal Blood was a US rock and roll band from Boston, MA. Their music ranges from noisy, spastic psychedelia to country-fried cowpunk, and probably would've fit in really well on a college radio station circa 1992. The band consisted of Brock Ginther, Michael Brierley, and Erik Magnus, who were all music nerds from Emerson College.\n---\n3) Royal Blood was a Canadian hardcore band from Calgary, Alberta and area. Ex-members of Figure Four.\n---\n4) Royal Blood was a US band from Tucson, AZ and formed in 2008. Royal Blood featured members of Shotgun Royale, A Tree Without Roots, The Devil's Sideshow, Boogie Nazis, We Are Lightning, Golden Alphabet and Long Live The Smoking Gun. Royal Blood blends old timey roots rock with modern rockabilly and tops it off with tasty rock n' roll riffs.\n---\n5) Royal Blood were two Spanish DJs and producers called Staxia and Shade K, see Royal Blood (SP).\n---\n6) Royal Blood was a 90’s US hard rock band who released their album Thanks Seattle...For Killing My Band and My Dreams! in 2011.\n---\n7) The Royal Blood was a black metal band from Portugal who released their album Incantation Of The Queen in 1997.",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Indie Rock",
      "Punk Blues"
    ]
  },
  "tracks": [
    "Figure It Out"
  ],
  "albums": [],
  "similar_artists": [
    "Nothing But Thieves",
    "The Blue Stones",
    "Cleopatrick",
    "Himalayas",
    "DEAD POET SOCIETY",
    "The Amazons"
  ],
  "youtube_videos": [
    {
      "title": "Figure It Out",
      "video_id": "5idPf5Irfxk"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/5idPf5Irfxk/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/royal%2bblood"
}