{
  "artist_name": "Snot",
  "slug": "snot",
  "metadata": {
    "country": "US",
    "genres": "[Nu Metal, hardcore, metal, Alternative Metal, Heavy Metal]",
    "active_years": "1995 - present",
    "band_type": "group",
    "lastfm_listeners": 377418,
    "lastfm_playcount": 6935390,
    "bio": "Snot was an American nu metal/alternative metal band from Santa Barbara, California that gained huge critical acclaim in the 1990's. The band was formed in 1995 by singer Lynn Strait, the former bassist of local metal band First Strike/Indica, and guitarist Mike Doling, formerly of Kronix. After building a strong following with performances in Los Angeles, Snot signed with Geffen Records, and began work on their debut album, Get Some, released on May 27, 1997. Although the album received positive critical notice, sales were disappointing.\n\nThe band performed on the 1998 Ozzfest tour. On July 9, 1998, Strait was arrested in Mansfield, Massachusetts, for indecent exposure after emerging nude from the oversized toilet prop used by Limp Bizkit in their performances. The band began work on their second album. On December 11, 1998, Strait died in a car accident when a truck struck his car, killing him and his boxer, Dobbs. The band disbanded following Strait's death in 1998. \n\nSnot had a new album recorded at the time of Lynn's death, but Strait had not recorded vocals for the album, it was decided that the album's vocal tracks would be completed by friends of Strait as a tribute called \"Strait Up.\" It was released on November 7, 2000, featured appearances by the lead vocalists of Korn, Slipknot, Sevendust, Hed PE, Coal Chamber, Sugar Ray, System of a Down, Incubus and Soulfly, among others. It peaked at #56 on the Billboard 200.\n\nA live album, Alive!, was released on July 30, 2002. It peaked at #12 on the Billboard Heatseekers chart. On April 5, 2007, the band reunited for a performance in Anaheim, California, with vocals performed by Invitro singer Jeff Weber.\n\nTen years later, they attempted a comeback with former Divine Heresy vocalist, Tommy Vext.\n\nAs of May 21 2009, Tommy Cummings and Sonny Mayo left the band, which was renamed \"Tons\" in 2009. You can hear Tons with their new vocalist, Brandon Espinoza at http://www.myspace.com/tonsrock",
    "allmusic_styles": [
      "Alternative Metal",
      "Heavy Metal",
      "Post-Grunge",
      "Punk Metal",
      "Funk Metal"
    ]
  },
  "tracks": [
    "The Box (Live At The Palace, Hollywood, CA., 1998)",
    "Stoopid",
    "Snot"
  ],
  "albums": [],
  "similar_artists": [
    "Primer 55",
    "Coal Chamber",
    "Slaves on Dope",
    "Dry Kill Logic",
    "Korn",
    "Brik"
  ],
  "youtube_videos": [],
  "images": [
    "https://picsum.photos/seed/snot-1/800/600",
    "https://picsum.photos/seed/snot-2/800/600",
    "https://picsum.photos/seed/snot-3/800/600"
  ],
  "lastfm_url": "https://www.last.fm/music/snot"
}