{
  "artist_name": "SZA",
  "slug": "sza",
  "metadata": {
    "country": "US",
    "genres": "[rnb, soul, alternative rnb, Alternative R&B, Contemporary R&B]",
    "active_years": "1989-11-08 - present",
    "band_type": "person",
    "lastfm_listeners": 3316727,
    "lastfm_playcount": 546918064,
    "bio": "Solána Imani Rowe, known professionally as SZA, is an American singer and songwriter. She was born in St. Louis, Missouri but raised in Maplewood, New Jersey. She self-released her debut EP, See.SZA.Run in October 2012. \n\nIn April 2013, SZA released her S EP to good critical reviews— in July of that same year, it was announced she was signed to Top Dawg Entertainment and began working on her Z EP, which would eventually become a full-fledged album. Z was released in April 2014. \n\nHer debut album, CTRL was released on June 9, 2017  through Top Dawg Entertainment and RCA Records. The album features guest appearances from Travis Scott, Kendrick Lamar, James Fauntleroy, and Isaiah Rashad. Upon release,  CTRL was a massive critical and commercial success, and catapulted SZA into fame. The record debuted at #3 on the Billboard 200. The album then received acclaim from music critics, many praised its cohesiveness and production, as well as SZA's vocal delivery. In 2018, CTRL  received 4 Grammy nominations. She was then nominated Best New Artist. The album was ranked at 472 on Rolling Stone's 500 Greatest Albums of All Time list, her first to do so.\n\n\nAfter a 5 year hiatus from music, SZA released her second studio album, SOS on December 9, 2022 through Top Dawg Entertainment and RCA Records.The album features guest appearances from Don Toliver, Phoebe Bridgers, Travis Scott, and the late Ol' Dirty Bastard. Six singles were released between 2020 and 2023 to promote SOS, five were top-ten hits on the US Billboard Hot 100. The fifth, \"Kill Bill\", was SZA's first song to hit #1 on the Billboard Hot 100. The album debuted at number one on the Billboard 200, SZA's first to do so, and also broke the record for the largest streaming week for an R&B album in the US alone. Several media publications ranked it as one of the best albums of 2022 and 2023. In 2023, it was ranked number 351 in Rolling Stone's 500 Greatest Albums of All Time, joining her debut album CTRL on the list.\n\nTo continue to promote the album, SZA had embarked on a North American, European, and Australian arena tour, the SOS Tour, from February 2023 to April 2024. \n\nAt the 66th Annual Grammy Awards, the album and its tracks received a total of nine nominations, including Album of the Year, and won Best Progressive R&B Album. The record was a total commercial success.\n\n\nSOS Deluxe: LANA is SZA's re-issue of her sophomore album SOS. SOS Deluxe: LANA was released on December 20th, 2024 through Top Dawg Entertainment and RCA Records. “Saturn\" was released as the album's lead single on February 22, 2024, and was teased and performed at the 66th Annual Grammy Awards. SZA said herself that this deluxe album became a whole other album. The album has 19 tracks, and includes leaked songs from SOS. The deluxe was hinted at on December 10, 2023, through various photos posted on her Instagram captioned “LANA”. On Februrary 9, 2025 SZA added an additional 4 tracks to the album including highly anticipated songs “PSA\", and “Joni (feat. Don Toliver)\".\n\nA few months after LANA's release, SZA embarked on a co-headlining concert tour called the \"Grand National Tour\" with American rapper Kendrick Lamar in support of Lamar's sixth studio album, GNX, and SZA's re-issued sophomore album, SOS Deluxe: LANA. It consists of 39 shows spanning over North America and Europe with an additional 9 Lamar solo concerts spanning over Australia and Latin America. The concert started on April 19, 2025, in Minneapolis, Minnesota and concluded on December 11, 2025 in Sydney, Australia.",
    "allmusic_styles": [
      "Alternative R&B",
      "Contemporary R&B"
    ]
  },
  "tracks": [
    "Snooze"
  ],
  "albums": [],
  "similar_artists": [
    "Summer Walker",
    "Kali Uchis",
    "Doja Cat",
    "Doechii",
    "Ariana Grande",
    "Mariah the Scientist"
  ],
  "youtube_videos": [
    {
      "title": "Snooze",
      "video_id": "ZqSlV5LmrTg"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/ZqSlV5LmrTg/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/sza"
}