{
  "artist_name": "The Bombpops",
  "slug": "the-bombpops",
  "metadata": {
    "country": "GB",
    "genres": "[punk rock, pop punk, punk, Alternative/Indie Rock, Pop Punk]",
    "active_years": "1960 - 1970-04-10",
    "band_type": "group",
    "lastfm_listeners": 39339,
    "lastfm_playcount": 866676,
    "bio": "This is ‘Death in Venice Beach’ Where The Bombpops had a Fear of Missing Out on their 2017 debut full-length, their highly anticipated follow up shows what happens when you’re too involved—with booze, bad situations, and behavior that’s unsustainable at best and destructive at worst.\nThis is Death in Venice Beach (out now on Fat Wreck Chords!), the comedown after the high, when clarity pierces the morning-after haze.\nIt’s right there in the title, an allusion to Thomas Mann’s celebrated novella about the price of an artistic life. The Bombpops co-founder and singer-guitarist Jen Razavi read it as the band debated titles for their second full-length. “It’s a cautionary tale to those that want to become an artist,” she says, “but it’s also really comforting to artists who can’t help or necessarily contain being who they are and what they’re drawn to.”\nWhat draws The Bombpops hasn’t changed: highly melodic punk with big guitars, vocal harmonies, and the SoCal sound that inspired Razavi, co-founder and singer-guitarist Poli van Dam, bassist Neil Wayne, and drummer Josh Lewis. But the more light-hearted skate punk of Fear of Missing Out has a serrated edge on Death in Venice Beach, as Razavi and van Dam explore darker themes—even though the songs are catchier than ever.\n“I want people to feel this dark, uneasy feeling,” says van Dam, who had plenty of her own in the three years since FOMO. She suffered a potentially life-threatening diabetic seizure on tour in the fall of 2018 (referenced in “Double Arrows Down,” one of album’s standout tracks), and she sought treatment for alcoholism while the new album was in post-production.\n\nhttp://thebombpops.com/",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Pop Punk",
      "Punk Revival"
    ]
  },
  "tracks": [
    "Dear Beer"
  ],
  "albums": [],
  "similar_artists": [
    "Bad Cop/Bad Cop",
    "Teenage Bottlerocket",
    "The Last Gang",
    "Not On Tour",
    "Go Betty Go",
    "No Use for a Name"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/39e898b56164630d6c8523240a74ef47.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/cd3f5e5e6ac9120e98825ad81a8e3a44.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/58012def90d6289cb1f53dea76a1b41a.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/the%2bbombpops"
}