{
  "artist_name": "Vanilla",
  "slug": "vanilla",
  "metadata": {
    "country": "US",
    "genres": "[screamo, instrumental hip-hop, emo]",
    "active_years": "1967-10-31 - present",
    "band_type": "person",
    "lastfm_listeners": 371722,
    "lastfm_playcount": 4594623,
    "bio": "There are multiple artists called Vanilla, as well as some called Vanille, which redirects here on last.fm:\n\n1) Vanilla -  Hugo Harrison - is an instrumental hip hop artist based in Oxford, UK. \nDiscography:\nTime Goes By Pt. II (2025)\nTime Goes By Pt. I (2025)\nTurn Me Loose (2021)\nPointbreak (2021)\nInto the Dream (2020)\nMoonlight (2017) \nOrigin (2015)\nSweet Talk (2014)\nFor What It's Worth (2013)\nSoft Focus (2012)\nHigh Life (2011)\nChrometrails (2010)\nNight Visions (2010)\nThought Process (2009)\n\nSpotify\nBandcamp\nSoundcloud\nTumblr\nYouTube\n\n2) Vanilla was a French emo band. Formed in 1992, Vanilla highly contributed to the rise of the so-called \"french hardcore scene\", along with the now defunct FINGER PRINT and IVICH (among others).\n\n3) Soca artist from Guyana\n\n4) Vanilla were a short-lived girl band from Barnet, London, England. They released just two singles for EMI  in the late 1990s.\n\n5) An electro/house artist.\n\n6) Girlband from Indonesia. Member : Ega, Anna, Mutia, ilo, Caca and Carla. Their first single is \"Beri Aku Waktu\". Vanilla is under Harpa Records and Red Icon Management.\n\n7)  Indie Pop singer from Quebec.\n\n8) Visual Kei band from Japan. Formed in early 2002 by Shinobu. The first demo tape was sold in selected stores in Tokyo on January 15 2002. Another demo tape was distributed at the first live at Shinjuku LOFT\nThe band had its first oneman live on July 13 at Meguro Rokumeikan right after the release of the first single.\nDrummer TAKA left the band in February 2003 in order to marry and retire from the music scene. Shiun from scissor was then invited to join as a support member.\nIn early 2003 Vanilla collaborated and toured with Fatima and also created an alter ego band titled Le+vanilla.\nOn July 13 it was announced that the band would cease its activities due to musical differences.\n\n9) Mid-90's punk band from Chicago, IL. Released two demos and recorded an album that went unreleased.\n\n10) Vanille Clerc, known mononymously as Vanille, is a French Pop singer, daughter of Julien Clerc.\n\n-\n\n2-continued) Definitely influenced by the then innovative American scene, VANILLA stood out with an emotional yet tortured hardcore style; very energetic and personal.\n\nAfter a few changes in the line-up , the band finds its definitive team in 1999 with former members Yves and Yann Maisonneuve (who were also part of IVICH) , Jean LeBrun(former bass player from 1992 to 1996 , now guitar player since 1999) and Alain Vidal (bass player since 1996) . Yves and Alain were also part of the short-lived band EL VIDAL SONIDO. 2001 is the year of their 3rd album release on Paris-based label SALVATION. This new turn in VANILLA's career marks important changes on a musical level but also on the songwriting field : the members' various influences bring a fresh inspiration yet staying faithful to their hardcore origins (the DISCHORD/Washington DC scene remains an unanimous source of inspiration within the band).\n\n7-continued) Rachel Leblanc is a young singer from Quebec, Canada, who performs under the name Vanille She's influenced by Françoise Hardy, Margo Guryan & Stereolab. In 2021, she released her first album Soleil '96, and followed it up with La clairière in 2023."
  },
  "tracks": [
    "Say It Again"
  ],
  "albums": [],
  "similar_artists": [
    "Flamingosis",
    "saib.",
    "Freddie Joachim",
    "Saib",
    "Birocratic",
    "MTBRD"
  ],
  "youtube_videos": [
    {
      "title": "Say It Again",
      "video_id": "BbajPVo-0dc"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/BbajPVo-0dc/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/vanilla"
}