{
  "artist_name": "Vulfpeck",
  "slug": "vulfpeck",
  "metadata": {
    "country": "US",
    "genres": "[funk, soul, jazz, R&B Instrumental, Instrumental Rock]",
    "active_years": "2011 - present",
    "band_type": "group",
    "lastfm_listeners": 571318,
    "lastfm_playcount": 22675337,
    "bio": "Vulfpeck is an American funk group founded in 2011 based in Los Angeles. The band has released four EPs, six albums, and a silent album on Spotify titled Sleepify, royalties from which funded Vulfpeck's admission-free tour in 2014. The band's most recent work was Clarity of Cal, a live album released in March 2025.\n\nThe band members attended University of Michigan's music school. They first came together as a rhythm section for a performance at the Duderstadt Center, a university facility that houses an arts library and other resources. After reading an interview with German producer Reinhold Mack, band founder Jack Stratton conceived of Vulfpeck as an imagined German version of the U.S. session musicians of the 1960s such as the Funk Brothers, the Wrecking Crew, and Muscle Shoals. The idea was to channel that era of the live rhythm section.\n\nThe band's founding members are Jack Stratton on keyboards, drums and guitar, Theo Katzman on guitar, drums and vocals, Woody Goss on keyboards, and Joe Dart on bass. Touring partners and frequent collaborators include Antwaun Stanley, Joey Dosik and Cory Wong. Other contributing musicians include Charles Jones, Christine Hucal, David T. Walker, Bernard Purdie, James Gadson and Blake Mills.",
    "allmusic_styles": [
      "R&B Instrumental",
      "Instrumental Rock",
      "Alternative/Indie Rock",
      "Indie Rock"
    ]
  },
  "tracks": [
    "Dean Town"
  ],
  "albums": [],
  "similar_artists": [
    "Cory Wong",
    "The Fearless Flyers",
    "Vulfmon",
    "Mark Lettieri",
    "Snarky Puppy",
    "Louis Cole"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/b5f96b6eb10fecf4b2030e127adeb9d3.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/a7f6d3cb290fe94029430086ae9954e4.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/a39415a86a1e768160ede09b739ef7dd.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/vulfpeck"
}