{
  "artist_name": "We The Kings",
  "slug": "we-the-kings",
  "metadata": {
    "country": "US",
    "genres": "[pop punk, powerpop, pop rock, Alternative/Indie Rock, Emo-Pop]",
    "active_years": "2005 - present",
    "band_type": "group",
    "lastfm_listeners": 1271289,
    "lastfm_playcount": 24456361,
    "bio": "We the Kings are an American rock band from Bradenton, Florida, currently signed to record label S-Curve Records. The band has released six studio albums (the latest being 2018's \"Six\") and completed a variety of tours. We the Kings also sports their own miniature series of webisodes, called 'The King's Carriage,\" detailing life on their tour bus. Furthermore, on MTV, We The Kings appeared on the show Silent Library.\n\nThe band members (Travis Clark - Lead Vocals/Rhythm Guitar/Piano, Hunter Thomsen - Lead Guitar ,Coley O'Toole - Backing Vocals/Piano, Charles Trippy - Bass, Danny Duncan - Drums) first met at Martha B. King Middle School in Bradenton, and their name refers to the school mascot. The group began playing together while at Manatee High School in the early 2000s, and landed on the PureVolume Top 10 list after hiring a manager.\n\nTours:\nTouring with bands such as Metro Station and Valencia, We the Kings is on the path to success. \nThey have toured with All Time Low, Boys Like Girls, and The Audition; as well as Mayday Parade, Madina Lake, and Powerspace. They have also toured with Cobra Starship, The Cab, and Metro Station, and were on the 2008 Warped Tour line-up. They have toured with The Academy Is..., Carolina Liar, and Hey Monday on the \"Bill and Trav's Bogus Journey Tour.\"",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Emo-Pop",
      "Alternative Pop/Rock"
    ]
  },
  "tracks": [
    "Skyway Avenue"
  ],
  "albums": [],
  "similar_artists": [
    "Boys Like Girls",
    "All Time Low",
    "Mayday Parade",
    "Forever the Sickest Kids",
    "Every Avenue",
    "Simple Plan"
  ],
  "youtube_videos": [],
  "images": [],
  "lastfm_url": "https://www.last.fm/music/we%2bthe%2bkings"
}