{
  "artist_name": "Woo",
  "slug": "woo",
  "metadata": {
    "country": "KR",
    "genres": "[ambient, new age, electronic, Alternative/Indie Rock, Experimental]",
    "active_years": "2017 - present",
    "band_type": "group",
    "lastfm_listeners": 179304,
    "lastfm_playcount": 2537896,
    "bio": "Several groups have gone by the name Woo. \n\n1. Woo is an electro-acoustic/ambient group consisting of the brothers Mark and Clive Ives. Their first albums originate as far back as 1982, and they have continued to release albums as recently as 2025. They produce a unique fusion of alternative, experimental, and electronic soundscapes with instrumental, acoustic guitar. The music can be described as experimental and relaxing. Most of their early compositions are instrumental, with vocals introduced on the album \"A La Luna\", and guest vocalists appearing on later albums.\nTheir discography has changed genre gradually with each release. Initially describing themselves as alternative, indie rock, lofi jazz, synth & nostalgic acoustic guitar music, the brothers Ives eventually shifted to albums described as ambient, new age, spiritual, angelic, instrumental music for meditation, relaxation & healing. \nAfter the release of the album \"Planning for a Miracle\", Woo shifted towards collaboration with Lena Chandler. The recent albums are described as \"Meditation & relaxation music for women during conception, pregnancy & labour preparation.\" Their website is located at: http://www.woo-music.co.uk\n\n\n2. Woo Won-jae (Korean: 우원재; born December 23, 1996), also known as Woo, is a South Korean rapper. In 2017, he released his debut single \"We Are\" (Korean: 시차; RR: Sicha) which had commercial success and widespread acclaim. He has released one studio album: Black Out (2020) one EP: af (2018). He is currently signed to hip hop label AOMG.\n\n3. See Wo0\n\n4. A Norwegian rock band went by the name of Woo from around 1994 until their final dissolution in 2002. Although they never released any material to the public, several demo recordings of their songs exist, most prominently the song \"Where the Rising Sun Will Stain\" and \"Nastavja Sé\". An EP, \"Pilot Song\", was to be released, and even got some radio attention in Norway, but ultimately never got released. The song \"Pilot Song\", however, circulates among enthusiasts to this date.",
    "allmusic_styles": [
      "Alternative/Indie Rock",
      "Experimental",
      "Experimental Electronic",
      "Indie Rock",
      "Keyboard/Synthesizer/New Age"
    ]
  },
  "tracks": [
    "시차 (We Are) (Feat. 로꼬 & GRAY)"
  ],
  "albums": [],
  "similar_artists": [
    "Josiah Steinbrick",
    "Deux Filles",
    "pH-1",
    "K. Leimer",
    "Domenique Dumont",
    "Slow Attack Ensemble"
  ],
  "youtube_videos": [],
  "images": [],
  "lastfm_url": "https://www.last.fm/music/woo"
}