{
  "artist_name": "yama",
  "slug": "yama",
  "metadata": {
    "country": "JP",
    "genres": "[Stoner Rock, Psychedelic Rock, japanese]",
    "active_years": "2013 - present",
    "band_type": "person",
    "lastfm_listeners": 256898,
    "lastfm_playcount": 6218832,
    "bio": "There are 4 known artist/group named Yama\n\n1) yama is a Japanese singer. She is known for her blue hair, her signature mask and her soft yet powerful voice, yama is also a member of BIN, along with tomato (illustrator) and T (producer).\n2) Yama has many meanings. Yama is the god of Death and Illusion in Tibetan vedism, the Japanese word for mountain, Papiamento for shouting and Sanskrit for ban or prohibition. Now we can add a meaning in Dutch as well: the stoner/doom colossus from Tilburg, home of Roadburn. Yama draws deeply from eastern mysteries, warps them into fuzz driven loudness, and drives them home with riffs and grooves the size of mountains. \n\nThe last two years have seen Yama off to one hell of a start. The Seaquake demo EP got raving reviews from reviewers around the world and quickly sold out twice: first as a self-released demo EP and another run released through Mind Flare Media.After a couple of local shows Yama soon shared the stage with bands like Saint Vitus, Graveyard and Orange Goblin, and performed at the renowned Yellowstock and Freak Valley festivals. \n\nIn 2013, Yama recorded their debut album: ANANTA. Ananta is a showcase of Yama's sound as well as song writing. Delving deep into doom, stoner and grunge, Yama has a taste for heaviness and a feel for the psychedelic. Heavy riffs and grooves to keep your head banging, with twists to keep you on your toes. Songs that get their heart and soul in jam sessions, and their balls by distilling them down to their core. Ananta will be released in 2014.\n\n3) Yamai (ヤマイ), officially known as \"KANAN\", is an utaite well-known for her powerful Megurine Luka-like voice with a distinct huskiness and her ability to balance both high and low notes. Her most popular cover is currently of \"E? Aa, Sou.\"Nv with over 3 million views as of September 2014.\n\nShe, Usa and Tourai as well as a couple of other producers are members of the group Usa Colony.\n\nShe is currently under contract with Love Sick Records, and has released five albums.\n\n4) Yama is the name of a Greek indie-pop duo formed in 2019 and based in Athens"
  },
  "tracks": [
    "Blood Flow"
  ],
  "albums": [],
  "similar_artists": [
    "Yoshino",
    "Afterglow",
    "Valis",
    "Eye",
    "Sick Hack",
    "MAISONdes"
  ],
  "youtube_videos": [
    {
      "title": "Blood Flow",
      "video_id": "sd1mAKAzpf0"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/sd1mAKAzpf0/maxresdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/yama"
}