{
  "artist_name": "Young Gun Silver Fox",
  "slug": "young-gun-silver-fox",
  "metadata": {
    "country": "GB",
    "genres": "[soft rock, soul, yacht rock]",
    "active_years": "2012 - present",
    "band_type": "group",
    "lastfm_listeners": 69544,
    "lastfm_playcount": 960705,
    "bio": "Young Gun Silver Fox are musical sorcerers. This smooth duo fashioned a fresh and modern sound that summons one of the most vibrant and influential epochs in popular music. The songs pay homage to 1970s Los Angeles, a golden age of recording that infused the pop charts and FM airwaves with a blend of soulful voices, immaculate melodies, stellar musicianship, and sophisticated studio technology. They’re considered to be the “second coming of Yacht Rock”.\nThe forces behind Young Gun Silver Fox are Andy Platts and Shawn Lee. It was inevitable that two of the UK's most prolific and versatile pop music linguists would one day collaborate and intertwine their creative strengths. Their albums fuse the talents they've mastered in their respective careers, from Andy's role as frontman and co-founder of Mamas Gun to Shawn's numerous self-produced projects with AM and his own Ping Pong Orchestra, even composing the soundtrack for the critically acclaimed 2006 video game Bully.  The authentic hybrid of styles intricately integrated into their music call back to the days of yacht rock and adult-oriented rock.\n\nChristian John Wikane \n(New York City / May 2015)"
  },
  "tracks": [
    "Kids"
  ],
  "albums": [],
  "similar_artists": [
    "Mamas Gun",
    "Michael McDonald",
    "Robbie Dupree",
    "Bill LaBounty",
    "Ned Doheny",
    "Ambrosia"
  ],
  "youtube_videos": [],
  "images": [
    "https://lastfm.freetls.fastly.net/i/u/ar0/b5e9752e909aee1073aa69f7d0ae1827.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/db19f5d567ff4067c0ea6b9444f73bfb.jpg",
    "https://lastfm.freetls.fastly.net/i/u/300x300/67118ff11d5b94ffae4cacc61974e176.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/young%2bgun%2bsilver%2bfox"
}