{
  "artist_name": "さとう。",
  "slug": "さとう",
  "metadata": {
    "country": "JP",
    "genres": "[j-pop, japanese, singer-songwriter]",
    "active_years": "2000-07-18 - present",
    "band_type": "person",
    "lastfm_listeners": 996,
    "lastfm_playcount": 12290,
    "bio": "Singer-songwriter born on July 18, 2000 in Izu, Shizuoka Prefecture\n\nIn 2013, when she was in her first year of junior high school, she asked for an electric guitar for Christmas, but was mistakenly given an acoustic guitar as a gift. She started playing the acoustic guitar reluctantly, but gradually became fascinated with the charm of singing and playing the guitar.\n\nIn 2014, when she was in the second year of junior high school, she started broadcasting songs on TwitCasting.\n\nIn 2018, when she was a third-year high school student, she appeared on Abema TV's \"Himura Goes High School Folk Song GP\" and began her music career in earnest.\n\n2019: Moved to Tokyo to become a musician\n\nJuly 2023: Held her first solo concert at Shimokitazawa DY CUBE, which sold out.\n\nStarting in January 2024, digital singles were released for seven consecutive months.\nThe first single, \"3%,\" became a hot topic on social media.\nMay: Provided the theme song \"Flowing Colors\" for the three-person play \"The Sons of the Monster.\"\nJuly: Held the second solo live show, \"It's Like a Newborn Cry,\" at Shibuya LOFT HEAVEN, and sold out.\n\nHer singing voice is delicate and ephemeral, yet possesses a vivid strength that is like a cry from the heart, and her life-sized lyrics resonate with the emotions of listeners, regardless of gender, as they are heard from their own perspective."
  },
  "tracks": [
    "つよがり",
    "3%"
  ],
  "albums": [],
  "similar_artists": [
    "コレサワ",
    "十明",
    "神はサイコロを振らない",
    "ねぐせ。",
    "平井 大",
    "おいしくるメロンパン"
  ],
  "youtube_videos": [
    {
      "title": "つよがり",
      "video_id": "tz4KxUzR1Ug"
    },
    {
      "title": "3%",
      "video_id": "-XsZE3oPlVk"
    }
  ],
  "images": [
    "https://i.ytimg.com/vi/tz4KxUzR1Ug/maxresdefault.jpg",
    "https://i.ytimg.com/vi/-XsZE3oPlVk/hqdefault.jpg"
  ],
  "lastfm_url": "https://www.last.fm/music/%25e3%2581%2595%25e3%2581%25a8%25e3%2581%2586%25e3%2580%2582"
}